[{"id":3,"category":"Python","title":">>>","content":"The default Python prompt of the interactive shell.  Often seen for code\nexamples which can be executed interactively in the interpreter.\n"},{"id":3,"category":"Python","title":"...","content":"Can refer to:\n\nThe default Python prompt of the interactive shell when entering the\ncode for an indented code block, when within a pair of matching left and\nright delimiters (parentheses, square brackets, curly braces or triple\nquotes), or after specifying a decorator.\nThe Ellipsis built-in constant.\n\n"},{"id":3,"category":"Python","title":"2to3","content":"A tool that tries to convert Python 2.x code to Python 3.x code by\nhandling most of the incompatibilities which can be detected by parsing the\nsource and traversing the parse tree.\n2to3 is available in the standard library as lib2to3; a standalone\nentry point is provided as Tools\/scripts\/2to3.  See\n2to3 — Automated Python 2 to 3 code translation.\n"},{"id":3,"category":"Python","title":"abstract base class","content":"Abstract base classes complement duck-typing by\nproviding a way to define interfaces when other techniques like\nhasattr() would be clumsy or subtly wrong (for example with\nmagic methods).  ABCs introduce virtual\nsubclasses, which are classes that don’t inherit from a class but are\nstill recognized by isinstance() and issubclass(); see the\nabc module documentation.  Python comes with many built-in ABCs for\ndata structures (in the collections.abc module), numbers (in the\nnumbers module), streams (in the io module), import finders\nand loaders (in the importlib.abc module).  You can create your own\nABCs with the abc module.\n"},{"id":3,"category":"Python","title":"annotation","content":"A label associated with a variable, a class\nattribute or a function parameter or return value,\nused by convention as a type hint.\nAnnotations of local variables cannot be accessed at runtime, but\nannotations of global variables, class attributes, and functions\nare stored in the __annotations__\nspecial attribute of modules, classes, and functions,\nrespectively.\nSee variable annotation, function annotation, PEP 484\nand PEP 526, which describe this functionality.\nAlso see Annotations Best Practices\nfor best practices on working with annotations.\n"},{"id":3,"category":"Python","title":"argument","content":"A value passed to a function (or method) when calling the\nfunction.  There are two kinds of argument:\n\nkeyword argument: an argument preceded by an identifier (e.g.\nname=) in a function call or passed as a value in a dictionary\npreceded by **.  For example, 3 and 5 are both keyword\narguments in the following calls to complex():\ncomplex(real=3, imag=5)\ncomplex(**{'real': 3, 'imag': 5})\n\n\n\npositional argument: an argument that is not a keyword argument.\nPositional arguments can appear at the beginning of an argument list\nand\/or be passed as elements of an iterable preceded by *.\nFor example, 3 and 5 are both positional arguments in the\nfollowing calls:\ncomplex(3, 5)\ncomplex(*(3, 5))\n\n\n\n\nArguments are assigned to the named local variables in a function body.\nSee the Calls section for the rules governing this assignment.\nSyntactically, any expression can be used to represent an argument; the\nevaluated value is assigned to the local variable.\nSee also the parameter glossary entry, the FAQ question on\nthe difference between arguments and parameters, and PEP 362.\n"},{"id":3,"category":"Python","title":"asynchronous context manager","content":"An object which controls the environment seen in an\nasync with statement by defining __aenter__() and\n__aexit__() methods.  Introduced by PEP 492.\n"},{"id":3,"category":"Python","title":"asynchronous generator","content":"A function which returns an asynchronous generator iterator.  It\nlooks like a coroutine function defined with async def except\nthat it contains yield expressions for producing a series of\nvalues usable in an async for loop.\nUsually refers to an asynchronous generator function, but may refer to an\nasynchronous generator iterator in some contexts.  In cases where the\nintended meaning isn’t clear, using the full terms avoids ambiguity.\nAn asynchronous generator function may contain await\nexpressions as well as async for, and async with\nstatements.\n"},{"id":3,"category":"Python","title":"asynchronous generator iterator","content":"An object created by a asynchronous generator function.\nThis is an asynchronous iterator which when called using the\n__anext__() method returns an awaitable object which will execute\nthe body of the asynchronous generator function until the next\nyield expression.\nEach yield temporarily suspends processing, remembering the\nlocation execution state (including local variables and pending\ntry-statements).  When the asynchronous generator iterator effectively\nresumes with another awaitable returned by __anext__(), it\npicks up where it left off.  See PEP 492 and PEP 525.\n"},{"id":3,"category":"Python","title":"asynchronous iterable","content":"An object, that can be used in an async for statement.\nMust return an asynchronous iterator from its\n__aiter__() method.  Introduced by PEP 492.\n"},{"id":3,"category":"Python","title":"asynchronous iterator","content":"An object that implements the __aiter__() and __anext__()\nmethods.  __anext__() must return an awaitable object.\nasync for resolves the awaitables returned by an asynchronous\niterator’s __anext__() method until it raises a\nStopAsyncIteration exception.  Introduced by PEP 492.\n"},{"id":3,"category":"Python","title":"attribute","content":"A value associated with an object which is usually referenced by name\nusing dotted expressions.\nFor example, if an object o has an attribute\na it would be referenced as o.a.\nIt is possible to give an object an attribute whose name is not an\nidentifier as defined by Identifiers and keywords, for example using\nsetattr(), if the object allows it.\nSuch an attribute will not be accessible using a dotted expression,\nand would instead need to be retrieved with getattr().\n"},{"id":3,"category":"Python","title":"awaitable","content":"An object that can be used in an await expression.  Can be\na coroutine or an object with an __await__() method.\nSee also PEP 492.\n"},{"id":3,"category":"Python","title":"BDFL","content":"Benevolent Dictator For Life, a.k.a. Guido van Rossum, Python’s creator.\n"},{"id":3,"category":"Python","title":"binary file","content":"A file object able to read and write\nbytes-like objects.\nExamples of binary files are files opened in binary mode ('rb',\n'wb' or 'rb+'), sys.stdin.buffer,\nsys.stdout.buffer, and instances of\nio.BytesIO and gzip.GzipFile.\nSee also text file for a file object able to read and write\nstr objects.\n"},{"id":3,"category":"Python","title":"borrowed reference","content":"In Python’s C API, a borrowed reference is a reference to an object,\nwhere the code using the object does not own the reference.\nIt becomes a dangling\npointer if the object is destroyed. For example, a garbage collection can\nremove the last strong reference to the object and so destroy it.\nCalling Py_INCREF() on the borrowed reference is\nrecommended to convert it to a strong reference in-place, except\nwhen the object cannot be destroyed before the last usage of the borrowed\nreference. The Py_NewRef() function can be used to create a new\nstrong reference.\n"},{"id":3,"category":"Python","title":"bytes-like object","content":"An object that supports the Buffer Protocol and can\nexport a C-contiguous buffer. This includes all bytes,\nbytearray, and array.array objects, as well as many\ncommon memoryview objects.  Bytes-like objects can\nbe used for various operations that work with binary data; these include\ncompression, saving to a binary file, and sending over a socket.\nSome operations need the binary data to be mutable.  The documentation\noften refers to these as “read-write bytes-like objects”.  Example\nmutable buffer objects include bytearray and a\nmemoryview of a bytearray.\nOther operations require the binary data to be stored in\nimmutable objects (“read-only bytes-like objects”); examples\nof these include bytes and a memoryview\nof a bytes object.\n"},{"id":3,"category":"Python","title":"bytecode","content":"Python source code is compiled into bytecode, the internal representation\nof a Python program in the CPython interpreter.  The bytecode is also\ncached in .pyc files so that executing the same file is\nfaster the second time (recompilation from source to bytecode can be\navoided).  This “intermediate language” is said to run on a\nvirtual machine that executes the machine code corresponding to\neach bytecode. Do note that bytecodes are not expected to work between\ndifferent Python virtual machines, nor to be stable between Python\nreleases.\nA list of bytecode instructions can be found in the documentation for\nthe dis module.\n"},{"id":3,"category":"Python","title":"callable","content":"A callable is an object that can be called, possibly with a set\nof arguments (see argument), with the following syntax:\ncallable(argument1, argument2, argumentN)\n\n\nA function, and by extension a method, is a callable.\nAn instance of a class that implements the __call__()\nmethod is also a callable.\n"},{"id":3,"category":"Python","title":"callback","content":"A subroutine function which is passed as an argument to be executed at\nsome point in the future.\n"},{"id":3,"category":"Python","title":"class","content":"A template for creating user-defined objects. Class definitions\nnormally contain method definitions which operate on instances of the\nclass.\n"},{"id":3,"category":"Python","title":"class variable","content":"A variable defined in a class and intended to be modified only at\nclass level (i.e., not in an instance of the class).\n"},{"id":3,"category":"Python","title":"complex number","content":"An extension of the familiar real number system in which all numbers are\nexpressed as a sum of a real part and an imaginary part.  Imaginary\nnumbers are real multiples of the imaginary unit (the square root of\n-1), often written i in mathematics or j in\nengineering.  Python has built-in support for complex numbers, which are\nwritten with this latter notation; the imaginary part is written with a\nj suffix, e.g., 3+1j.  To get access to complex equivalents of the\nmath module, use cmath.  Use of complex numbers is a fairly\nadvanced mathematical feature.  If you’re not aware of a need for them,\nit’s almost certain you can safely ignore them.\n"},{"id":3,"category":"Python","title":"context manager","content":"An object which controls the environment seen in a with\nstatement by defining __enter__() and __exit__() methods.\nSee PEP 343.\n"},{"id":3,"category":"Python","title":"context variable","content":"A variable which can have different values depending on its context.\nThis is similar to Thread-Local Storage in which each execution\nthread may have a different value for a variable. However, with context\nvariables, there may be several contexts in one execution thread and the\nmain usage for context variables is to keep track of variables in\nconcurrent asynchronous tasks.\nSee contextvars.\n"},{"id":3,"category":"Python","title":"contiguous","content":"A buffer is considered contiguous exactly if it is either\nC-contiguous or Fortran contiguous.  Zero-dimensional buffers are\nC and Fortran contiguous.  In one-dimensional arrays, the items\nmust be laid out in memory next to each other, in order of\nincreasing indexes starting from zero.  In multidimensional\nC-contiguous arrays, the last index varies the fastest when\nvisiting items in order of memory address.  However, in\nFortran contiguous arrays, the first index varies the fastest.\n"},{"id":3,"category":"Python","title":"coroutine","content":"Coroutines are a more generalized form of subroutines. Subroutines are\nentered at one point and exited at another point.  Coroutines can be\nentered, exited, and resumed at many different points.  They can be\nimplemented with the async def statement.  See also\nPEP 492.\n"},{"id":3,"category":"Python","title":"coroutine function","content":"A function which returns a coroutine object.  A coroutine\nfunction may be defined with the async def statement,\nand may contain await, async for, and\nasync with keywords.  These were introduced\nby PEP 492.\n"},{"id":3,"category":"Python","title":"CPython","content":"The canonical implementation of the Python programming language, as\ndistributed on python.org.  The term “CPython”\nis used when necessary to distinguish this implementation from others\nsuch as Jython or IronPython.\n"},{"id":3,"category":"Python","title":"decorator","content":"A function returning another function, usually applied as a function\ntransformation using the @wrapper syntax.  Common examples for\ndecorators are classmethod() and staticmethod().\nThe decorator syntax is merely syntactic sugar, the following two\nfunction definitions are semantically equivalent:\ndef f(arg):\n    ...\nf = staticmethod(f)\n\n@staticmethod\ndef f(arg):\n    ...\n\n\nThe same concept exists for classes, but is less commonly used there.  See\nthe documentation for function definitions and\nclass definitions for more about decorators.\n"},{"id":3,"category":"Python","title":"descriptor","content":"Any object which defines the methods __get__(),\n__set__(), or __delete__().\nWhen a class attribute is a descriptor, its special\nbinding behavior is triggered upon attribute lookup.  Normally, using\na.b to get, set or delete an attribute looks up the object named b in\nthe class dictionary for a, but if b is a descriptor, the respective\ndescriptor method gets called.  Understanding descriptors is a key to a\ndeep understanding of Python because they are the basis for many features\nincluding functions, methods, properties, class methods, static methods,\nand reference to super classes.\nFor more information about descriptors’ methods, see Implementing Descriptors\nor the Descriptor How To Guide.\n"},{"id":3,"category":"Python","title":"dictionary","content":"An associative array, where arbitrary keys are mapped to values.  The\nkeys can be any object with __hash__() and\n__eq__() methods.\nCalled a hash in Perl.\n"},{"id":3,"category":"Python","title":"dictionary comprehension","content":"A compact way to process all or part of the elements in an iterable and\nreturn a dictionary with the results. results = {n: n ** 2 for n in\nrange(10)} generates a dictionary containing key n mapped to\nvalue n ** 2. See Displays for lists, sets and dictionaries.\n"},{"id":3,"category":"Python","title":"dictionary view","content":"The objects returned from dict.keys(), dict.values(), and\ndict.items() are called dictionary views. They provide a dynamic\nview on the dictionary’s entries, which means that when the dictionary\nchanges, the view reflects these changes. To force the\ndictionary view to become a full list use list(dictview).  See\nDictionary view objects.\n"},{"id":3,"category":"Python","title":"docstring","content":"A string literal which appears as the first expression in a class,\nfunction or module.  While ignored when the suite is executed, it is\nrecognized by the compiler and put into the __doc__ attribute\nof the enclosing class, function or module.  Since it is available via\nintrospection, it is the canonical place for documentation of the\nobject.\n"},{"id":3,"category":"Python","title":"duck-typing","content":"A programming style which does not look at an object’s type to determine\nif it has the right interface; instead, the method or attribute is simply\ncalled or used (“If it looks like a duck and quacks like a duck, it\nmust be a duck.”)  By emphasizing interfaces rather than specific types,\nwell-designed code improves its flexibility by allowing polymorphic\nsubstitution.  Duck-typing avoids tests using type() or\nisinstance().  (Note, however, that duck-typing can be complemented\nwith abstract base classes.)  Instead, it\ntypically employs hasattr() tests or EAFP programming.\n"},{"id":3,"category":"Python","title":"EAFP","content":"Easier to ask for forgiveness than permission.  This common Python coding\nstyle assumes the existence of valid keys or attributes and catches\nexceptions if the assumption proves false.  This clean and fast style is\ncharacterized by the presence of many try and except\nstatements.  The technique contrasts with the LBYL style\ncommon to many other languages such as C.\n"},{"id":3,"category":"Python","title":"expression","content":"A piece of syntax which can be evaluated to some value.  In other words,\nan expression is an accumulation of expression elements like literals,\nnames, attribute access, operators or function calls which all return a\nvalue.  In contrast to many other languages, not all language constructs\nare expressions.  There are also statements which cannot be used\nas expressions, such as while.  Assignments are also statements,\nnot expressions.\n"},{"id":3,"category":"Python","title":"extension module","content":"A module written in C or C++, using Python’s C API to interact with the\ncore and with user code.\n"},{"id":3,"category":"Python","title":"f-string","content":"String literals prefixed with 'f' or 'F' are commonly called\n“f-strings” which is short for\nformatted string literals.  See also PEP 498.\n"},{"id":3,"category":"Python","title":"file object","content":"An object exposing a file-oriented API (with methods such as\nread() or write()) to an underlying resource.  Depending\non the way it was created, a file object can mediate access to a real\non-disk file or to another type of storage or communication device\n(for example standard input\/output, in-memory buffers, sockets, pipes,\netc.).  File objects are also called file-like objects or\nstreams.\nThere are actually three categories of file objects: raw\nbinary files, buffered\nbinary files and text files.\nTheir interfaces are defined in the io module.  The canonical\nway to create a file object is by using the open() function.\n"},{"id":3,"category":"Python","title":"file-like object","content":"A synonym for file object.\n"},{"id":3,"category":"Python","title":"filesystem encoding and error handler","content":"Encoding and error handler used by Python to decode bytes from the\noperating system and encode Unicode to the operating system.\nThe filesystem encoding must guarantee to successfully decode all bytes\nbelow 128. If the file system encoding fails to provide this guarantee,\nAPI functions can raise UnicodeError.\nThe sys.getfilesystemencoding() and\nsys.getfilesystemencodeerrors() functions can be used to get the\nfilesystem encoding and error handler.\nThe filesystem encoding and error handler are configured at\nPython startup by the PyConfig_Read() function: see\nfilesystem_encoding and\nfilesystem_errors members of PyConfig.\nSee also the locale encoding.\n"},{"id":3,"category":"Python","title":"finder","content":"An object that tries to find the loader for a module that is\nbeing imported.\nSince Python 3.3, there are two types of finder: meta path finders for use with sys.meta_path, and path\nentry finders for use with sys.path_hooks.\nSee PEP 302, PEP 420 and PEP 451 for much more detail.\n"},{"id":3,"category":"Python","title":"floor division","content":"Mathematical division that rounds down to nearest integer.  The floor\ndivision operator is \/\/.  For example, the expression 11 \/\/ 4\nevaluates to 2 in contrast to the 2.75 returned by float true\ndivision.  Note that (-11) \/\/ 4 is -3 because that is -2.75\nrounded downward. See PEP 238.\n"},{"id":3,"category":"Python","title":"function","content":"A series of statements which returns some value to a caller. It can also\nbe passed zero or more arguments which may be used in\nthe execution of the body. See also parameter, method,\nand the Function definitions section.\n"},{"id":3,"category":"Python","title":"function annotation","content":"An annotation of a function parameter or return value.\nFunction annotations are usually used for\ntype hints: for example, this function is expected to take two\nint arguments and is also expected to have an int\nreturn value:\ndef sum_two_numbers(a: int, b: int) -> int:\n   return a + b\n\n\nFunction annotation syntax is explained in section Function definitions.\nSee variable annotation and PEP 484,\nwhich describe this functionality.\nAlso see Annotations Best Practices\nfor best practices on working with annotations.\n"},{"id":3,"category":"Python","title":"__future__","content":"A future statement, from __future__ import <feature>,\ndirects the compiler to compile the current module using syntax or\nsemantics that will become standard in a future release of Python.\nThe __future__ module documents the possible values of\nfeature.  By importing this module and evaluating its variables,\nyou can see when a new feature was first added to the language and\nwhen it will (or did) become the default:\n>>> import __future__\n>>> __future__.division\n_Feature((2, 2, 0, 'alpha', 2), (3, 0, 0, 'alpha', 0), 8192)\n\n\n"},{"id":3,"category":"Python","title":"garbage collection","content":"The process of freeing memory when it is not used anymore.  Python\nperforms garbage collection via reference counting and a cyclic garbage\ncollector that is able to detect and break reference cycles.  The\ngarbage collector can be controlled using the gc module.\n"},{"id":3,"category":"Python","title":"generator","content":"A function which returns a generator iterator.  It looks like a\nnormal function except that it contains yield expressions\nfor producing a series of values usable in a for-loop or that can be\nretrieved one at a time with the next() function.\nUsually refers to a generator function, but may refer to a\ngenerator iterator in some contexts.  In cases where the intended\nmeaning isn’t clear, using the full terms avoids ambiguity.\n"},{"id":3,"category":"Python","title":"generator iterator","content":"An object created by a generator function.\nEach yield temporarily suspends processing, remembering the\nlocation execution state (including local variables and pending\ntry-statements).  When the generator iterator resumes, it picks up where\nit left off (in contrast to functions which start fresh on every\ninvocation).\n"},{"id":3,"category":"Python","title":"generator expression","content":"An expression that returns an iterator.  It looks like a normal expression\nfollowed by a for clause defining a loop variable, range,\nand an optional if clause.  The combined expression\ngenerates values for an enclosing function:\n>>> sum(i*i for i in range(10))         # sum of squares 0, 1, 4, ... 81\n285\n\n\n"},{"id":3,"category":"Python","title":"generic function","content":"A function composed of multiple functions implementing the same operation\nfor different types. Which implementation should be used during a call is\ndetermined by the dispatch algorithm.\nSee also the single dispatch glossary entry, the\nfunctools.singledispatch() decorator, and PEP 443.\n"},{"id":3,"category":"Python","title":"generic type","content":"A type that can be parameterized; typically a\ncontainer class such as list or\ndict. Used for type hints and\nannotations.\nFor more details, see generic alias types,\nPEP 483, PEP 484, PEP 585, and the typing module.\n"},{"id":3,"category":"Python","title":"GIL","content":"See global interpreter lock.\n"},{"id":3,"category":"Python","title":"global interpreter lock","content":"The mechanism used by the CPython interpreter to assure that\nonly one thread executes Python bytecode at a time.\nThis simplifies the CPython implementation by making the object model\n(including critical built-in types such as dict) implicitly\nsafe against concurrent access.  Locking the entire interpreter\nmakes it easier for the interpreter to be multi-threaded, at the\nexpense of much of the parallelism afforded by multi-processor\nmachines.\nHowever, some extension modules, either standard or third-party,\nare designed so as to release the GIL when doing computationally intensive\ntasks such as compression or hashing.  Also, the GIL is always released\nwhen doing I\/O.\nPast efforts to create a “free-threaded” interpreter (one which locks\nshared data at a much finer granularity) have not been successful\nbecause performance suffered in the common single-processor case. It\nis believed that overcoming this performance issue would make the\nimplementation much more complicated and therefore costlier to maintain.\n"},{"id":3,"category":"Python","title":"hash-based pyc","content":"A bytecode cache file that uses the hash rather than the last-modified\ntime of the corresponding source file to determine its validity. See\nCached bytecode invalidation.\n"},{"id":3,"category":"Python","title":"hashable","content":"An object is hashable if it has a hash value which never changes during\nits lifetime (it needs a __hash__() method), and can be\ncompared to other objects (it needs an __eq__() method).\nHashable objects which\ncompare equal must have the same hash value.\nHashability makes an object usable as a dictionary key and a set member,\nbecause these data structures use the hash value internally.\nMost of Python’s immutable built-in objects are hashable; mutable\ncontainers (such as lists or dictionaries) are not; immutable\ncontainers (such as tuples and frozensets) are only hashable if\ntheir elements are hashable.  Objects which are\ninstances of user-defined classes are hashable by default.  They all\ncompare unequal (except with themselves), and their hash value is derived\nfrom their id().\n"},{"id":3,"category":"Python","title":"IDLE","content":"An Integrated Development and Learning Environment for Python.\nIDLE is a basic editor and interpreter environment\nwhich ships with the standard distribution of Python.\n"},{"id":3,"category":"Python","title":"immutable","content":"An object with a fixed value.  Immutable objects include numbers, strings and\ntuples.  Such an object cannot be altered.  A new object has to\nbe created if a different value has to be stored.  They play an important\nrole in places where a constant hash value is needed, for example as a key\nin a dictionary.\n"},{"id":3,"category":"Python","title":"import path","content":"A list of locations (or path entries) that are\nsearched by the path based finder for modules to import. During\nimport, this list of locations usually comes from sys.path, but\nfor subpackages it may also come from the parent package’s __path__\nattribute.\n"},{"id":3,"category":"Python","title":"importing","content":"The process by which Python code in one module is made available to\nPython code in another module.\n"},{"id":3,"category":"Python","title":"importer","content":"An object that both finds and loads a module; both a\nfinder and loader object.\n"},{"id":3,"category":"Python","title":"interactive","content":"Python has an interactive interpreter which means you can enter\nstatements and expressions at the interpreter prompt, immediately\nexecute them and see their results.  Just launch python with no\narguments (possibly by selecting it from your computer’s main\nmenu). It is a very powerful way to test out new ideas or inspect\nmodules and packages (remember help(x)).\n"},{"id":3,"category":"Python","title":"interpreted","content":"Python is an interpreted language, as opposed to a compiled one,\nthough the distinction can be blurry because of the presence of the\nbytecode compiler.  This means that source files can be run directly\nwithout explicitly creating an executable which is then run.\nInterpreted languages typically have a shorter development\/debug cycle\nthan compiled ones, though their programs generally also run more\nslowly.  See also interactive.\n"},{"id":3,"category":"Python","title":"interpreter shutdown","content":"When asked to shut down, the Python interpreter enters a special phase\nwhere it gradually releases all allocated resources, such as modules\nand various critical internal structures.  It also makes several calls\nto the garbage collector. This can trigger\nthe execution of code in user-defined destructors or weakref callbacks.\nCode executed during the shutdown phase can encounter various\nexceptions as the resources it relies on may not function anymore\n(common examples are library modules or the warnings machinery).\nThe main reason for interpreter shutdown is that the __main__ module\nor the script being run has finished executing.\n"},{"id":3,"category":"Python","title":"iterable","content":"An object capable of returning its members one at a time. Examples of\niterables include all sequence types (such as list, str,\nand tuple) and some non-sequence types like dict,\nfile objects, and objects of any classes you define\nwith an __iter__() method or with a\n__getitem__() method\nthat implements sequence semantics.\nIterables can be\nused in a for loop and in many other places where a sequence is\nneeded (zip(), map(), …).  When an iterable object is passed\nas an argument to the built-in function iter(), it returns an\niterator for the object.  This iterator is good for one pass over the set\nof values.  When using iterables, it is usually not necessary to call\niter() or deal with iterator objects yourself.  The for\nstatement does that automatically for you, creating a temporary unnamed\nvariable to hold the iterator for the duration of the loop.  See also\niterator, sequence, and generator.\n"},{"id":3,"category":"Python","title":"iterator","content":"An object representing a stream of data.  Repeated calls to the iterator’s\n__next__() method (or passing it to the built-in function\nnext()) return successive items in the stream.  When no more data\nare available a StopIteration exception is raised instead.  At this\npoint, the iterator object is exhausted and any further calls to its\n__next__() method just raise StopIteration again.  Iterators\nare required to have an __iter__() method that returns the iterator\nobject itself so every iterator is also iterable and may be used in most\nplaces where other iterables are accepted.  One notable exception is code\nwhich attempts multiple iteration passes.  A container object (such as a\nlist) produces a fresh new iterator each time you pass it to the\niter() function or use it in a for loop.  Attempting this\nwith an iterator will just return the same exhausted iterator object used\nin the previous iteration pass, making it appear like an empty container.\nMore information can be found in Iterator Types.\n\nCPython implementation detail: CPython does not consistently apply the requirement that an iterator\ndefine __iter__().\n\n"},{"id":3,"category":"Python","title":"key function","content":"A key function or collation function is a callable that returns a value\nused for sorting or ordering.  For example, locale.strxfrm() is\nused to produce a sort key that is aware of locale specific sort\nconventions.\nA number of tools in Python accept key functions to control how elements\nare ordered or grouped.  They include min(), max(),\nsorted(), list.sort(), heapq.merge(),\nheapq.nsmallest(), heapq.nlargest(), and\nitertools.groupby().\nThere are several ways to create a key function.  For example. the\nstr.lower() method can serve as a key function for case insensitive\nsorts.  Alternatively, a key function can be built from a\nlambda expression such as lambda r: (r[0], r[2]).  Also,\noperator.attrgetter(), operator.itemgetter(), and\noperator.methodcaller() are three key function constructors.  See the Sorting HOW TO for examples of how to create and use key functions.\n"},{"id":3,"category":"Python","title":"keyword argument","content":"See argument.\n"},{"id":3,"category":"Python","title":"lambda","content":"An anonymous inline function consisting of a single expression\nwhich is evaluated when the function is called.  The syntax to create\na lambda function is lambda [parameters]: expression\n"},{"id":3,"category":"Python","title":"LBYL","content":"Look before you leap.  This coding style explicitly tests for\npre-conditions before making calls or lookups.  This style contrasts with\nthe EAFP approach and is characterized by the presence of many\nif statements.\nIn a multi-threaded environment, the LBYL approach can risk introducing a\nrace condition between “the looking” and “the leaping”.  For example, the\ncode, if key in mapping: return mapping[key] can fail if another\nthread removes key from mapping after the test, but before the lookup.\nThis issue can be solved with locks or by using the EAFP approach.\n"},{"id":3,"category":"Python","title":"locale encoding","content":"On Unix, it is the encoding of the LC_CTYPE locale. It can be set with\nlocale.setlocale(locale.LC_CTYPE, new_locale).\nOn Windows, it is the ANSI code page (ex: \"cp1252\").\nOn Android and VxWorks, Python uses \"utf-8\" as the locale encoding.\nlocale.getencoding() can be used to get the locale encoding.\nSee also the filesystem encoding and error handler.\n"},{"id":3,"category":"Python","title":"list","content":"A built-in Python sequence.  Despite its name it is more akin\nto an array in other languages than to a linked list since access to\nelements is O(1).\n"},{"id":3,"category":"Python","title":"list comprehension","content":"A compact way to process all or part of the elements in a sequence and\nreturn a list with the results.  result = ['{:#04x}'.format(x) for x in\nrange(256) if x % 2 == 0] generates a list of strings containing\neven hex numbers (0x..) in the range from 0 to 255. The if\nclause is optional.  If omitted, all elements in range(256) are\nprocessed.\n"},{"id":3,"category":"Python","title":"loader","content":"An object that loads a module. It must define a method named\nload_module(). A loader is typically returned by a\nfinder. See PEP 302 for details and\nimportlib.abc.Loader for an abstract base class.\n"},{"id":3,"category":"Python","title":"magic method","content":"An informal synonym for special method.\n"},{"id":3,"category":"Python","title":"mapping","content":"A container object that supports arbitrary key lookups and implements the\nmethods specified in the collections.abc.Mapping or\ncollections.abc.MutableMapping\nabstract base classes.  Examples\ninclude dict, collections.defaultdict,\ncollections.OrderedDict and collections.Counter.\n"},{"id":3,"category":"Python","title":"meta path finder","content":"A finder returned by a search of sys.meta_path.  Meta path\nfinders are related to, but different from path entry finders.\nSee importlib.abc.MetaPathFinder for the methods that meta path\nfinders implement.\n"},{"id":3,"category":"Python","title":"metaclass","content":"The class of a class.  Class definitions create a class name, a class\ndictionary, and a list of base classes.  The metaclass is responsible for\ntaking those three arguments and creating the class.  Most object oriented\nprogramming languages provide a default implementation.  What makes Python\nspecial is that it is possible to create custom metaclasses.  Most users\nnever need this tool, but when the need arises, metaclasses can provide\npowerful, elegant solutions.  They have been used for logging attribute\naccess, adding thread-safety, tracking object creation, implementing\nsingletons, and many other tasks.\nMore information can be found in Metaclasses.\n"},{"id":3,"category":"Python","title":"method","content":"A function which is defined inside a class body.  If called as an attribute\nof an instance of that class, the method will get the instance object as\nits first argument (which is usually called self).\nSee function and nested scope.\n"},{"id":3,"category":"Python","title":"method resolution order","content":"Method Resolution Order is the order in which base classes are searched\nfor a member during lookup. See The Python 2.3 Method Resolution Order for details of the\nalgorithm used by the Python interpreter since the 2.3 release.\n"},{"id":3,"category":"Python","title":"module","content":"An object that serves as an organizational unit of Python code.  Modules\nhave a namespace containing arbitrary Python objects.  Modules are loaded\ninto Python by the process of importing.\nSee also package.\n"},{"id":3,"category":"Python","title":"module spec","content":"A namespace containing the import-related information used to load a\nmodule. An instance of importlib.machinery.ModuleSpec.\n"},{"id":3,"category":"Python","title":"MRO","content":"See method resolution order.\n"},{"id":3,"category":"Python","title":"mutable","content":"Mutable objects can change their value but keep their id().  See\nalso immutable.\n"},{"id":3,"category":"Python","title":"named tuple","content":"The term “named tuple” applies to any type or class that inherits from\ntuple and whose indexable elements are also accessible using named\nattributes.  The type or class may have other features as well.\nSeveral built-in types are named tuples, including the values returned\nby time.localtime() and os.stat().  Another example is\nsys.float_info:\n>>> sys.float_info[1]                   # indexed access\n1024\n>>> sys.float_info.max_exp              # named field access\n1024\n>>> isinstance(sys.float_info, tuple)   # kind of tuple\nTrue\n\n\nSome named tuples are built-in types (such as the above examples).\nAlternatively, a named tuple can be created from a regular class\ndefinition that inherits from tuple and that defines named\nfields.  Such a class can be written by hand or it can be created with\nthe factory function collections.namedtuple().  The latter\ntechnique also adds some extra methods that may not be found in\nhand-written or built-in named tuples.\n"},{"id":3,"category":"Python","title":"namespace","content":"The place where a variable is stored.  Namespaces are implemented as\ndictionaries.  There are the local, global and built-in namespaces as well\nas nested namespaces in objects (in methods).  Namespaces support\nmodularity by preventing naming conflicts.  For instance, the functions\nbuiltins.open and os.open() are distinguished by\ntheir namespaces.  Namespaces also aid readability and maintainability by\nmaking it clear which module implements a function.  For instance, writing\nrandom.seed() or itertools.islice() makes it clear that those\nfunctions are implemented by the random and itertools\nmodules, respectively.\n"},{"id":3,"category":"Python","title":"namespace package","content":"A PEP 420 package which serves only as a container for\nsubpackages.  Namespace packages may have no physical representation,\nand specifically are not like a regular package because they\nhave no __init__.py file.\nSee also module.\n"},{"id":3,"category":"Python","title":"nested scope","content":"The ability to refer to a variable in an enclosing definition.  For\ninstance, a function defined inside another function can refer to\nvariables in the outer function.  Note that nested scopes by default work\nonly for reference and not for assignment.  Local variables both read and\nwrite in the innermost scope.  Likewise, global variables read and write\nto the global namespace.  The nonlocal allows writing to outer\nscopes.\n"},{"id":3,"category":"Python","title":"new-style class","content":"Old name for the flavor of classes now used for all class objects.  In\nearlier Python versions, only new-style classes could use Python’s newer,\nversatile features like __slots__, descriptors,\nproperties, __getattribute__(), class methods, and static\nmethods.\n"},{"id":3,"category":"Python","title":"object","content":"Any data with state (attributes or value) and defined behavior\n(methods).  Also the ultimate base class of any new-style\nclass.\n"},{"id":3,"category":"Python","title":"package","content":"A Python module which can contain submodules or recursively,\nsubpackages.  Technically, a package is a Python module with a\n__path__ attribute.\nSee also regular package and namespace package.\n"},{"id":3,"category":"Python","title":"parameter","content":"A named entity in a function (or method) definition that\nspecifies an argument (or in some cases, arguments) that the\nfunction can accept.  There are five kinds of parameter:\n\npositional-or-keyword: specifies an argument that can be passed\neither positionally or as a keyword argument.  This is the default kind of parameter, for example foo\nand bar in the following:\ndef func(foo, bar=None): ...\n\n\n\n\n\npositional-only: specifies an argument that can be supplied only\nby position. Positional-only parameters can be defined by including a\n\/ character in the parameter list of the function definition after\nthem, for example posonly1 and posonly2 in the following:\ndef func(posonly1, posonly2, \/, positional_or_keyword): ...\n\n\n\n\n\nkeyword-only: specifies an argument that can be supplied only\nby keyword.  Keyword-only parameters can be defined by including a\nsingle var-positional parameter or bare * in the parameter list\nof the function definition before them, for example kw_only1 and\nkw_only2 in the following:\ndef func(arg, *, kw_only1, kw_only2): ...\n\n\n\nvar-positional: specifies that an arbitrary sequence of\npositional arguments can be provided (in addition to any positional\narguments already accepted by other parameters).  Such a parameter can\nbe defined by prepending the parameter name with *, for example\nargs in the following:\ndef func(*args, **kwargs): ...\n\n\n\nvar-keyword: specifies that arbitrarily many keyword arguments\ncan be provided (in addition to any keyword arguments already accepted\nby other parameters).  Such a parameter can be defined by prepending\nthe parameter name with **, for example kwargs in the example\nabove.\n\nParameters can specify both optional and required arguments, as well as\ndefault values for some optional arguments.\nSee also the argument glossary entry, the FAQ question on\nthe difference between arguments and parameters, the inspect.Parameter class, the\nFunction definitions section, and PEP 362.\n"},{"id":3,"category":"Python","title":"path entry","content":"A single location on the import path which the path\nbased finder consults to find modules for importing.\n"},{"id":3,"category":"Python","title":"path entry finder","content":"A finder returned by a callable on sys.path_hooks\n(i.e. a path entry hook) which knows how to locate modules given\na path entry.\nSee importlib.abc.PathEntryFinder for the methods that path entry\nfinders implement.\n"},{"id":3,"category":"Python","title":"path entry hook","content":"A callable on the sys.path_hooks list which returns a path\nentry finder if it knows how to find modules on a specific path\nentry.\n"},{"id":3,"category":"Python","title":"path based finder","content":"One of the default meta path finders which\nsearches an import path for modules.\n"},{"id":3,"category":"Python","title":"path-like object","content":"An object representing a file system path. A path-like object is either\na str or bytes object representing a path, or an object\nimplementing the os.PathLike protocol. An object that supports\nthe os.PathLike protocol can be converted to a str or\nbytes file system path by calling the os.fspath() function;\nos.fsdecode() and os.fsencode() can be used to guarantee a\nstr or bytes result instead, respectively. Introduced\nby PEP 519.\n"},{"id":3,"category":"Python","title":"PEP","content":"Python Enhancement Proposal. A PEP is a design document\nproviding information to the Python community, or describing a new\nfeature for Python or its processes or environment. PEPs should\nprovide a concise technical specification and a rationale for proposed\nfeatures.\nPEPs are intended to be the primary mechanisms for proposing major new\nfeatures, for collecting community input on an issue, and for documenting\nthe design decisions that have gone into Python. The PEP author is\nresponsible for building consensus within the community and documenting\ndissenting opinions.\nSee PEP 1.\n"},{"id":3,"category":"Python","title":"portion","content":"A set of files in a single directory (possibly stored in a zip file)\nthat contribute to a namespace package, as defined in PEP 420.\n"},{"id":3,"category":"Python","title":"positional argument","content":"See argument.\n"},{"id":3,"category":"Python","title":"provisional API","content":"A provisional API is one which has been deliberately excluded from\nthe standard library’s backwards compatibility guarantees.  While major\nchanges to such interfaces are not expected, as long as they are marked\nprovisional, backwards incompatible changes (up to and including removal\nof the interface) may occur if deemed necessary by core developers.  Such\nchanges will not be made gratuitously – they will occur only if serious\nfundamental flaws are uncovered that were missed prior to the inclusion\nof the API.\nEven for provisional APIs, backwards incompatible changes are seen as\na “solution of last resort” - every attempt will still be made to find\na backwards compatible resolution to any identified problems.\nThis process allows the standard library to continue to evolve over\ntime, without locking in problematic design errors for extended periods\nof time.  See PEP 411 for more details.\n"},{"id":3,"category":"Python","title":"provisional package","content":"See provisional API.\n"},{"id":3,"category":"Python","title":"Python 3000","content":"Nickname for the Python 3.x release line (coined long ago when the\nrelease of version 3 was something in the distant future.)  This is also\nabbreviated “Py3k”.\n"},{"id":3,"category":"Python","title":"Pythonic","content":"An idea or piece of code which closely follows the most common idioms\nof the Python language, rather than implementing code using concepts\ncommon to other languages.  For example, a common idiom in Python is\nto loop over all elements of an iterable using a for\nstatement.  Many other languages don’t have this type of construct, so\npeople unfamiliar with Python sometimes use a numerical counter instead:\nfor i in range(len(food)):\n    print(food[i])\n\n\nAs opposed to the cleaner, Pythonic method:\nfor piece in food:\n    print(piece)\n\n\n"},{"id":3,"category":"Python","title":"qualified name","content":"A dotted name showing the “path” from a module’s global scope to a\nclass, function or method defined in that module, as defined in\nPEP 3155.  For top-level functions and classes, the qualified name\nis the same as the object’s name:\n>>> class C:\n...     class D:\n...         def meth(self):\n...             pass\n...\n>>> C.__qualname__\n'C'\n>>> C.D.__qualname__\n'C.D'\n>>> C.D.meth.__qualname__\n'C.D.meth'\n\n\nWhen used to refer to modules, the fully qualified name means the\nentire dotted path to the module, including any parent packages,\ne.g. email.mime.text:\n>>> import email.mime.text\n>>> email.mime.text.__name__\n'email.mime.text'\n\n\n"},{"id":3,"category":"Python","title":"reference count","content":"The number of references to an object.  When the reference count of an\nobject drops to zero, it is deallocated.  Some objects are\n“immortal” and have reference counts that are never modified, and\ntherefore the objects are never deallocated.  Reference counting is\ngenerally not visible to Python code, but it is a key element of the\nCPython implementation.  Programmers can call the\nsys.getrefcount() function to return the\nreference count for a particular object.\n"},{"id":3,"category":"Python","title":"regular package","content":"A traditional package, such as a directory containing an\n__init__.py file.\nSee also namespace package.\n"},{"id":3,"category":"Python","title":"__slots__","content":"A declaration inside a class that saves memory by pre-declaring space for\ninstance attributes and eliminating instance dictionaries.  Though\npopular, the technique is somewhat tricky to get right and is best\nreserved for rare cases where there are large numbers of instances in a\nmemory-critical application.\n"},{"id":3,"category":"Python","title":"sequence","content":"An iterable which supports efficient element access using integer\nindices via the __getitem__() special method and defines a\n__len__() method that returns the length of the sequence.\nSome built-in sequence types are list, str,\ntuple, and bytes. Note that dict also\nsupports __getitem__() and __len__(), but is considered a\nmapping rather than a sequence because the lookups use arbitrary\nimmutable keys rather than integers.\nThe collections.abc.Sequence abstract base class\ndefines a much richer interface that goes beyond just\n__getitem__() and __len__(), adding\ncount(), index(), __contains__(), and\n__reversed__(). Types that implement this expanded\ninterface can be registered explicitly using\nregister().\n"},{"id":3,"category":"Python","title":"set comprehension","content":"A compact way to process all or part of the elements in an iterable and\nreturn a set with the results. results = {c for c in 'abracadabra' if\nc not in 'abc'} generates the set of strings {'r', 'd'}.  See\nDisplays for lists, sets and dictionaries.\n"},{"id":3,"category":"Python","title":"single dispatch","content":"A form of generic function dispatch where the implementation is\nchosen based on the type of a single argument.\n"},{"id":3,"category":"Python","title":"slice","content":"An object usually containing a portion of a sequence.  A slice is\ncreated using the subscript notation, [] with colons between numbers\nwhen several are given, such as in variable_name[1:3:5].  The bracket\n(subscript) notation uses slice objects internally.\n"},{"id":3,"category":"Python","title":"special method","content":"A method that is called implicitly by Python to execute a certain\noperation on a type, such as addition.  Such methods have names starting\nand ending with double underscores.  Special methods are documented in\nSpecial method names.\n"},{"id":3,"category":"Python","title":"statement","content":"A statement is part of a suite (a “block” of code).  A statement is either\nan expression or one of several constructs with a keyword, such\nas if, while or for.\n"},{"id":3,"category":"Python","title":"static type checker","content":"An external tool that reads Python code and analyzes it, looking for\nissues such as incorrect types. See also type hints\nand the typing module.\n"},{"id":3,"category":"Python","title":"strong reference","content":"In Python’s C API, a strong reference is a reference to an object\nwhich is owned by the code holding the reference.  The strong\nreference is taken by calling Py_INCREF() when the\nreference is created and released with Py_DECREF()\nwhen the reference is deleted.\nThe Py_NewRef() function can be used to create a strong reference\nto an object. Usually, the Py_DECREF() function must be called on\nthe strong reference before exiting the scope of the strong reference, to\navoid leaking one reference.\nSee also borrowed reference.\n"},{"id":3,"category":"Python","title":"text encoding","content":"A string in Python is a sequence of Unicode code points (in range\nU+0000–U+10FFFF). To store or transfer a string, it needs to be\nserialized as a sequence of bytes.\nSerializing a string into a sequence of bytes is known as “encoding”, and\nrecreating the string from the sequence of bytes is known as “decoding”.\nThere are a variety of different text serialization\ncodecs, which are collectively referred to as\n“text encodings”.\n"},{"id":3,"category":"Python","title":"text file","content":"A file object able to read and write str objects.\nOften, a text file actually accesses a byte-oriented datastream\nand handles the text encoding automatically.\nExamples of text files are files opened in text mode ('r' or 'w'),\nsys.stdin, sys.stdout, and instances of\nio.StringIO.\nSee also binary file for a file object able to read and write\nbytes-like objects.\n"},{"id":3,"category":"Python","title":"triple-quoted string","content":"A string which is bound by three instances of either a quotation mark\n(”) or an apostrophe (‘).  While they don’t provide any functionality\nnot available with single-quoted strings, they are useful for a number\nof reasons.  They allow you to include unescaped single and double\nquotes within a string and they can span multiple lines without the\nuse of the continuation character, making them especially useful when\nwriting docstrings.\n"},{"id":3,"category":"Python","title":"type","content":"The type of a Python object determines what kind of object it is; every\nobject has a type.  An object’s type is accessible as its\n__class__ attribute or can be retrieved with\ntype(obj).\n"},{"id":3,"category":"Python","title":"type alias","content":"A synonym for a type, created by assigning the type to an identifier.\nType aliases are useful for simplifying type hints.\nFor example:\ndef remove_gray_shades(\n        colors: list[tuple[int, int, int]]) -> list[tuple[int, int, int]]:\n    pass\n\n\ncould be made more readable like this:\nColor = tuple[int, int, int]\n\ndef remove_gray_shades(colors: list[Color]) -> list[Color]:\n    pass\n\n\nSee typing and PEP 484, which describe this functionality.\n"},{"id":3,"category":"Python","title":"type hint","content":"An annotation that specifies the expected type for a variable, a class\nattribute, or a function parameter or return value.\nType hints are optional and are not enforced by Python but\nthey are useful to static type checkers.\nThey can also aid IDEs with code completion and refactoring.\nType hints of global variables, class attributes, and functions,\nbut not local variables, can be accessed using\ntyping.get_type_hints().\nSee typing and PEP 484, which describe this functionality.\n"},{"id":3,"category":"Python","title":"universal newlines","content":"A manner of interpreting text streams in which all of the following are\nrecognized as ending a line: the Unix end-of-line convention '\\n',\nthe Windows convention '\\r\\n', and the old Macintosh convention\n'\\r'.  See PEP 278 and PEP 3116, as well as\nbytes.splitlines() for an additional use.\n"},{"id":3,"category":"Python","title":"variable annotation","content":"An annotation of a variable or a class attribute.\nWhen annotating a variable or a class attribute, assignment is optional:\nclass C:\n    field: 'annotation'\n\n\nVariable annotations are usually used for\ntype hints: for example this variable is expected to take\nint values:\ncount: int = 0\n\n\nVariable annotation syntax is explained in section Annotated assignment statements.\nSee function annotation, PEP 484\nand PEP 526, which describe this functionality.\nAlso see Annotations Best Practices\nfor best practices on working with annotations.\n"},{"id":3,"category":"Python","title":"virtual environment","content":"A cooperatively isolated runtime environment that allows Python users\nand applications to install and upgrade Python distribution packages\nwithout interfering with the behaviour of other Python applications\nrunning on the same system.\nSee also venv.\n"},{"id":3,"category":"Python","title":"virtual machine","content":"A computer defined entirely in software.  Python’s virtual machine\nexecutes the bytecode emitted by the bytecode compiler.\n"},{"id":3,"category":"Python","title":"Zen of Python","content":"Listing of Python design principles and philosophies that are helpful in\nunderstanding and using the language.  The listing can be found by typing\n“import this” at the interactive prompt.\n"},{"id":2,"category":"Excel","title":"3-D reference","content":"A reference to a range that spans two or more worksheets in a workbook."},{"id":2,"category":"Excel","title":"3-D walls and floor","content":"The areas surrounding many 3-D chart types that give dimension and boundaries to the chart. Two walls and one floor are displayed within the plot area."},{"id":2,"category":"Excel","title":"Active cell","content":"The selected cell in which data is entered when you begin typing. Only one cell is active at a time. The active cell is bounded by a heavy border."},{"id":2,"category":"Excel","title":"Active sheet","content":"The sheet that you're working on in a workbook. The name on the tab of the active sheet is bold."},{"id":2,"category":"Excel","title":"Alternate startup folder","content":"A folder in addition to the XLStart folder that contains workbooks or other files that you want to be opened automatically when you start Excel and templates that you want to be available when you create new workbooks."},{"id":2,"category":"Excel","title":"Alternate startup folder","content":"A folder in addition to the XLStart folder that contains workbooks or other files that you want to be opened automatically when you start Excel and templates that you want to be available when you create new workbooks."},{"id":2,"category":"Excel","title":"Array formula","content":"A formula that performs multiple calculations on one or more sets of values, and then returns either a single result or multiple results. Array formulas are enclosed between braces { } and are entered by pressing CTRL+SHIFT+ENTER."},{"id":2,"category":"Excel","title":"Associated PivotTable","content":"The PivotTable that supplies the source data to the PivotChart. It is created automatically when you create a new PivotChart. When you change the layout of either report, the other also changes."},{"id":2,"category":"Excel","title":"Base address","content":"The relative path that Excel uses for the destination address when you insert a hyperlink. This can be an Internet address (URL), a path to a folder on your hard drive, or a path to a folder on a network."},{"id":2,"category":"Excel","title":"Calculated column","content":"In an Excel table, a calculated column uses a single formula that adjusts for each row. It automatically expands to include additional rows so that the formula is immediately extended to those rows."},{"id":2,"category":"Excel","title":"Calculated field (database)","content":"A field in the result set of a query that displays the result of an expression rather than data from a database."},{"id":2,"category":"Excel","title":"Calculated field (PivotTable)","content":"A field in a PivotTable or PivotChart that uses a formula you create. Calculated fields can perform calculations by using the contents of other fields in the PivotTable or PivotChart."},{"id":2,"category":"Excel","title":"Calculated item","content":"An item within a PivotTable field or PivotChart field that uses a formula you create. Calculated items can perform calculations by using the contents of other items within the same field of the PivotTable or PivotChart."},{"id":2,"category":"Excel","title":"Category axis","content":"A chart axis that represents the category for each data point. It displays arbitrary text values like Qtr1, Qtr2, and Qtr3; it cannot display scaled numerical values."},{"id":2,"category":"Excel","title":"Category field","content":"A field that's displayed in the category area of the PivotChart. Items in a category field appear as the labels on the category axis."},{"id":2,"category":"Excel","title":"Cell reference","content":"The set of coordinates that a cell occupies on a worksheet. For example, the reference of the cell that appears at the intersection of column B and row 3 is B3."},{"id":2,"category":"Excel","title":"Certifying authority","content":"A commercial organization, or a group within a company, that uses tools such as Microsoft Certificate Server to provide digital certificates that software developers can use to sign macros and users can use to sign documents."},{"id":2,"category":"Excel","title":"Change history","content":"In a shared workbook, information that is maintained about changes made in past editing sessions. The information includes the name of the person who made each change, when the change was made, and what data was changed."},{"id":2,"category":"Excel","title":"Chart area","content":"The entire chart and all its elements."},{"id":2,"category":"Excel","title":"Chart sheet","content":"A sheet in a workbook that contains only a chart. A chart sheet is beneficial when you want to view a chart or a PivotChart separately from worksheet data or a PivotTable."},{"id":2,"category":"Excel","title":"Column field","content":"A field that's assigned a column orientation in a PivotTable. Items associated with a column field are displayed as column labels."},{"id":2,"category":"Excel","title":"Column heading","content":"The shaded area at the top of each Data pane column that contains the field name."},{"id":2,"category":"Excel","title":"Column heading","content":"The lettered or numbered gray area at the top of each column. Click the column heading to select an entire column. To increase or decrease the width of a column, drag the line to the right of the column heading."},{"id":2,"category":"Excel","title":"Comparison criteria","content":"A set of search conditions that is used to find data. Comparison criteria can be a series of characters that you want to match, such as \"Northwind Traders,\" or an expression, such as \">300.\""},{"id":2,"category":"Excel","title":"Comparison operator","content":"A sign that is used in comparison criteria to compare two values. The six standards are = Equal to, > Greater than, < Less than, >= Greater than or equal to, <= Less than or equal to, and <> Not equal to."},{"id":2,"category":"Excel","title":"Conditional format","content":"A format, such as cell shading or font color, that Excel automatically applies to cells if a specified condition is true."},{"id":2,"category":"Excel","title":"Consolidation table","content":"The table of combined results that appears in the destination area. Excel creates the consolidation table by applying the summary function that you select to the source area values that you specify."},{"id":2,"category":"Excel","title":"Copy area","content":"The cells that you copy when you want to paste data into another location. After you copy cells, a moving border appears around them to indicate that they've been copied."},{"id":2,"category":"Excel","title":"Criteria pane","content":"The area of the window that displays the criteria used to limit the records included in the result set of your query."},{"id":2,"category":"Excel","title":"Current region","content":"The block of filled-in cells that includes the currently selected cell or cells. The region extends in all directions to the first empty row or column."},{"id":2,"category":"Excel","title":"Custom calculation","content":"A method of summarizing values in the data area of a PivotTable by using the values in other cells in the data area. Use the Show data as list on the PivotTable Field dialog for a data field to create custom calculations."},{"id":2,"category":"Excel","title":"Data form","content":"A dialog box that displays one complete record at a time. You can use data forms to add, change, locate, and delete records."},{"id":2,"category":"Excel","title":"Data label","content":"A label that provides additional information about a data marker, which represents a single data point or value that originates from a datasheet cell."},{"id":2,"category":"Excel","title":"Data marker","content":"A bar, area, dot, slice, or other symbol in a chart that represents a single data point or value that originates from a datasheet cell. Related data markers in a chart constitute a data series."},{"id":2,"category":"Excel","title":"Data pane","content":"The area of the window that displays the result set of your query."},{"id":2,"category":"Excel","title":"Data points","content":"Individual values that are plotted in a chart. Related data points make up a data series. Data points are represented by bars, columns, lines, slices, dots, and other shapes. These shapes are called data markers."},{"id":2,"category":"Excel","title":"Data region","content":"A range of cells that contains data and that is bounded by empty cells or datasheet borders."},{"id":2,"category":"Excel","title":"Data series","content":"Related data points that are plotted in a chart and originate from datasheet rows or columns. Each data series in a chart has a unique color or pattern. You can plot one or more data series in a chart. Pie charts have only one data series."},{"id":2,"category":"Excel","title":"Data source","content":"A stored set of \"source\" information used to connect to a database. A data source can include the name and location of the database server, the name of the database driver, and information that the database needs when you log on."},{"id":2,"category":"Excel","title":"Data source driver","content":"A program file used to connect to a specific database. Each database program or management system requires a different driver."},{"id":2,"category":"Excel","title":"Data table","content":"A range of cells that shows the results of substituting different values in one or more formulas. There are two types of data tables: one-input tables and two-input tables."},{"id":2,"category":"Excel","title":"Data table in charts","content":"A grid that can be added to some charts and contains the numeric data used to create the chart. The data table usually is attached to the horizontal axis of the chart and replaces the tick-mark labels on the horizontal axis."},{"id":2,"category":"Excel","title":"Data validation","content":"An Excel feature that you can use to define restrictions on what data can or should be entered in a cell, and to display messages that prompt users for correct entries and notify users about incorrect entries."},{"id":2,"category":"Excel","title":"DDE conversation","content":"The interaction between two applications that are communicating and exchanging data through special functions and code known as dynamic data exchange (DDE)."},{"id":2,"category":"Excel","title":"Default startup workbook","content":"The new, unsaved workbook that's displayed when you start Excel. The default startup workbook is displayed only if you haven't included other workbooks in the XLStart folder."},{"id":2,"category":"Excel","title":"Default workbook template","content":"The Book.xlt template that you create to change the default format of new workbooks. Excel uses the template to create a blank workbook when you start Excel or create a new workbook without specifying a template."},{"id":2,"category":"Excel","title":"Default worksheet template","content":"The Sheet.xlt template that you create to change the default format of new worksheets. Excel uses the template to create a blank worksheet when you add a new worksheet to a workbook."},{"id":2,"category":"Excel","title":"Destination area","content":"The range of cells that you select to hold the summarized data in a consolidation. The destination area can be on the same worksheet as the source data or on a different worksheet. A worksheet can contain only one consolidation."},{"id":2,"category":"Excel","title":"Detail data","content":"For automatic subtotals and worksheet outlines, the subtotal rows or columns that are totaled by summary data. Detail data is typically adjacent to and either above or to the left of the summary data."},{"id":2,"category":"Excel","title":"Drop lines","content":"In line and area charts, lines that extend from a data point to the category (x) axis. Useful in area charts to clarify where one data marker ends and the next begins."},{"id":2,"category":"Excel","title":"Drop-down list box","content":"A control on a menu, toolbar, or dialog box that displays a list of options when you click the small arrow next to the list box."},{"id":2,"category":"Excel","title":"Embedded chart","content":"A chart that is placed on a worksheet rather than on a separate chart sheet. Embedded charts are beneficial when you want to view or print a chart or a PivotChart with its source data or other information in a worksheet."},{"id":2,"category":"Excel","title":"Error bars","content":"Usually used in statistical or scientific data, error bars show potential error or degree of uncertainty relative to each data marker in a series."},{"id":2,"category":"Excel","title":"Excel add-in","content":"Components that can be installed on your computer to add commands and functions to Excel. These add-in programs are specific to Excel. Other add-in programs that are available for Excel or Office are Component Object Model (COM) add-ins."},{"id":2,"category":"Excel","title":"Excel table","content":"Formerly known as an Excel list, you can create, format, and expand an Excel table to organize the data on your worksheet."},{"id":2,"category":"Excel","title":"External data","content":"Data that is stored in a database, such as Access, dBASE, or SQL Server, that is separate from Query and the program from which you started Query."},{"id":2,"category":"Excel","title":"External data","content":"Data that is stored outside of Excel. Examples include databases created in Access, dBASE, SQL Server, or on a Web server."},{"id":2,"category":"Excel","title":"External data range","content":"A range of data that is brought into a worksheet but that originates outside of Excel, such as in a database or text file. In Excel, you can format the data or use it in calculations as you would any other data."},{"id":2,"category":"Excel","title":"External reference","content":"A reference to a cell or range on a sheet in another Excel workbook, or a reference to a defined name in another workbook."},{"id":2,"category":"Excel","title":"Field (database)","content":"A category of information, such as last name or order amount, that is stored in a table. When Query displays a result set in its Data pane, a field is represented as a column."},{"id":2,"category":"Excel","title":"Field (PivotTable)","content":"In a PivotTable or PivotChart, a category of data that's derived from a field in the source data. PivotTables have row, column, page, and data fields. PivotCharts have series, category, page, and data fields."},{"id":2,"category":"Excel","title":"Fill handle","content":"The small black square in the lower-right corner of the selection. When you point to the fill handle, the pointer changes to a black cross."},{"id":2,"category":"Excel","title":"Formula bar","content":"A bar at the top of the Excel window that you use to enter or edit values or formulas in cells or charts. Displays the constant value or formula stored in the active cell."},{"id":2,"category":"Excel","title":"Formula Palette","content":"A tool that helps you create or edit a formula and also provides information about functions and their arguments."},{"id":2,"category":"Excel","title":"Function (Microsoft Query)","content":"An expression that returns a value based on the results of a calculation. Query assumes that data sources support the Avg, Count, Max, Min, and Sum functions. Some data sources may not support all of these, or may support additional functions."},{"id":2,"category":"Excel","title":"Function (Office Excel)","content":"A prewritten formula that takes a value or values, performs an operation, and returns a value or values. Use functions to simplify and shorten formulas on a worksheet, especially those that perform lengthy or complex calculations."},{"id":2,"category":"Excel","title":"Goal seek","content":"A method to find a specific value for a cell by adjusting the value of one other cell. When goal seeking, Excel varies the value in a cell that you specify until a formula that's dependent on that cell returns the result you want."},{"id":2,"category":"Excel","title":"Gridlines in charts","content":"Lines you can add to a chart that make it easier to view and evaluate data. Gridlines extend from the tick marks on an axis across the plot area."},{"id":2,"category":"Excel","title":"High-low lines","content":"In 2-D line charts, lines that extend from the highest to the lowest value in each category. High-low lines are often used in stock charts."},{"id":2,"category":"Excel","title":"History worksheet","content":"A separate worksheet that lists changes being tracked in a shared workbook, including the name of the person who made the change, when and where it was made, what data was deleted or replaced, and how conflicts were resolved."},{"id":2,"category":"Excel","title":"Implicit intersection","content":"A reference to a range of cells, instead of a single cell, that is calculated like a single cell. If cell C10 contains the formula =B5:B15*5, Excel multiplies the value in cell B10 by 5 because cells B10 and C10 are in the same row."},{"id":2,"category":"Excel","title":"Inner join","content":"In Query, default type of join between two tables where only the records that have the same values in the joined fields are selected. The two matching records from each table are combined and displayed as one record in the result set."},{"id":2,"category":"Excel","title":"Input cell","content":"The cell in which each input value from a data table is substituted. Any cell on a worksheet can be the input cell. Although the input cell does not need to be part of the data table, the formulas in data tables must refer to the input cell."},{"id":2,"category":"Excel","title":"Insert row","content":"In an Excel table, a special row that facilitates data entry. The Insert row is indicated by an asterisk."},{"id":2,"category":"Excel","title":"Internet Explorer","content":"A Web browser that interprets HTML files, formats them into Web pages, and displays them to the user. You can download Internet Explorer from the Microsoft Web site at http:\/\/www.microsoft.com."},{"id":2,"category":"Excel","title":"Join line","content":"In Query, a line that connects fields between two tables and shows Query how the data is related. The type of join indicates which records are selected for the query's result set."},{"id":2,"category":"Excel","title":"Join line","content":"In Query, a line that connects fields between two tables and shows how the data is related. The type of join indicates which records are selected for the query's result set."},{"id":2,"category":"Excel","title":"Legend keys","content":"Symbols in legends that show the patterns and colors assigned to the data series (or categories) in a chart. Legend keys appear to the left of legend entries. Formatting a legend key also formats the data marker that's associated with it."},{"id":2,"category":"Excel","title":"Locked field or record","content":"The condition of a record, field, or other object in a database that permits it to be viewed but not changed (read-only) in Query."},{"id":2,"category":"Excel","title":"Mapped range","content":"A range in an XML list that has been linked to an element in an XML map."},{"id":2,"category":"Excel","title":"Merged cell","content":"A single cell that is created by combining two or more selected cells. The cell reference for a merged cell is the upper-left cell in the original selected range."},{"id":2,"category":"Excel","title":"Microsoft Excel control","content":"A native Excel control other than an ActiveX control."},{"id":2,"category":"Excel","title":"Microsoft Visual Basic Help","content":"To get help for Visual Basic in Excel, on the Developer tab, in the Code group, click Visual Basic, and then under the Help menu, click Microsoft Visual Basic Help."},{"id":2,"category":"Excel","title":"Moving average","content":"A sequence of averages computed from parts of a data series. In a chart, a moving average smooths the fluctuations in data, thus showing the pattern or trend more clearly."},{"id":2,"category":"Excel","title":"Moving border","content":"An animated border that appears around a worksheet range that has been cut or copied. To cancel a moving border, press ESC."},{"id":2,"category":"Excel","title":"Multiple-level category labels","content":"Category labels in a chart that, based on worksheet data, are automatically displayed on more than one line in a hierarchy. For example, the heading Produce might appear above a row with headings Tofu, Apples, and Pears."},{"id":2,"category":"Excel","title":"Name box","content":"Box at left end of the formula bar that identifies the selected cell, chart item, or drawing object. To name a cell or range, type the name in the Name box and press ENTER. To move to and select a named cell, click its name in the Name box."},{"id":2,"category":"Excel","title":"Nonadjacent selection","content":"A selection of two or more cells or ranges that don't touch each other. When plotting nonadjacent selections in a chart, make sure that the combined selections form a rectangular shape."},{"id":2,"category":"Excel","title":"Non-OLAP source data","content":"Underlying data for a PivotTable or PivotChart that comes from a source other than an OLAP database. These sources include relational databases, tables on Excel worksheets, and text file databases."},{"id":2,"category":"Excel","title":"Offline cube file","content":"A file you create on your hard disk or a network share to store OLAP source data for a PivotTable or PivotChart. Offline cube files allow you to keep working when you are not connected to the OLAP server."},{"id":2,"category":"Excel","title":"OLAP provider","content":"A set of software that provides access to a particular type of OLAP database. This software can include a data source driver and other client software that is necessary to connect to a database."},{"id":2,"category":"Excel","title":"Outer join","content":"In Query, a join where all records from one table are selected, even if there are no matching records in another table. Records that match are combined and shown as one. Records that don't have matches in the other table are shown empty."},{"id":2,"category":"Excel","title":"Outer join","content":"Join in which all records from one table are selected, even if there are no matching records in another table. Records that match are combined and shown as one. Records that don't have matches in the other table are shown as empty."},{"id":2,"category":"Excel","title":"Outline data","content":"The data that is contained within a worksheet outline. Outline data includes both the summary and detail rows or columns of an outline."},{"id":2,"category":"Excel","title":"Outline symbols","content":"Symbols that you use to change the view of an outlined worksheet. You can show or hide detailed data by pressing the plus sign, minus sign, and the numbers 1, 2, 3, or 4, indicating the outline level."},{"id":2,"category":"Excel","title":"Page break","content":"Divider that breaks a worksheet into separate pages for printing. Excel inserts automatic page breaks based on the paper size, margin settings, scaling options, and the positions of any manual page breaks that you insert."},{"id":2,"category":"Excel","title":"Page break preview","content":"Worksheet view that displays the areas to be printed and the locations of page breaks. The area to be printed is displayed in white, automatic page breaks appear as dashed lines, and manual page breaks appear as solid lines."},{"id":2,"category":"Excel","title":"Parameter query","content":"A type of query that, when you run it, prompts for values (criteria) to use to select the records for the result set so that the same query can be used to retrieve different result sets."},{"id":2,"category":"Excel","title":"Paste area","content":"The target destination for data that's been cut or copied by using the Office Clipboard."},{"id":2,"category":"Excel","title":"Pivot area","content":"The worksheet area into which you drag PivotTable or PivotChart fields to change the layout of the report. On a new report, dashed blue outlines indicate the pivot area on the worksheet."},{"id":2,"category":"Excel","title":"PivotChart category field","content":"A field that is assigned a category orientation in a PivotChart. In a chart, categories usually appear on the x-axis, or horizontal axis, of the chart."},{"id":2,"category":"Excel","title":"PivotChart series field","content":"A field that is assigned a series orientation in a PivotChart. In a chart, series are represented in the legend."},{"id":2,"category":"Excel","title":"PivotTable data","content":"In a PivotTable, the summarized data that's calculated from the data fields of a source list or table."},{"id":2,"category":"Excel","title":"PivotTable grand totals","content":"Total values for all cells in a row or all cells in a column of a PivotTable. Values in a grand total row or column are calculated by using the same summary function used in the data area of the PivotTable."},{"id":2,"category":"Excel","title":"PivotTable list","content":"A Microsoft Office Web Component that allows you to create a structure similar to an Excel PivotTable. Users can view the PivotTable list in a Web browser and change its layout in a manner similar to an Excel PivotTable."},{"id":2,"category":"Excel","title":"PivotTable subtotal","content":"A row or column that uses a summary function to display the total of detail items in a PivotTable field."},{"id":2,"category":"Excel","title":"Plot area","content":"In a 2-D chart, the area bounded by the axes, including all data series. In a 3-D chart, the area bounded by the axes, including the data series, category names, tick-mark labels, and axis titles."},{"id":2,"category":"Excel","title":"Primary key","content":"One or more fields that uniquely identify each record in a table. In the same way that a license plate number identifies a car, the primary key uniquely identifies a record."},{"id":2,"category":"Excel","title":"Print area","content":"One or more ranges of cells that you designate to print when you don't want to print the entire worksheet. If a worksheet includes a print area, only the print area is printed."},{"id":2,"category":"Excel","title":"Print titles","content":"Row or column labels that are printed at the top of or on the left side of every page on a printed worksheet."},{"id":2,"category":"Excel","title":"Property fields","content":"Independent attributes associated with items, or members, in an OLAP cube. For example, if city items have size and population properties stored in the server cube, a PivotTable can display the size and population of each city."},{"id":2,"category":"Excel","title":"Query channel","content":"You use a query channel in a DDE conversation between the destination application and a specific query (for example, Query1) in Query. To use a query channel, you must have already opened the query window using a system channel."},{"id":2,"category":"Excel","title":"Query design","content":"All elements included in the Query window, such as tables, criteria, the order in which fields are arranged, and so on. The design also specifies whether Auto Query is turned on, and whether you can edit the source data."},{"id":2,"category":"Excel","title":"Refresh (external data range)","content":"To update data from an external data source. Each time you refresh data, you see the most recent version of the information in the database, including any changes that were made to the data."},{"id":2,"category":"Excel","title":"Refresh (PivotTable)","content":"To update the contents of a PivotTable or PivotChart to reflect changes to the underlying source data. If the report is based on external data, refreshing runs the underlying query to retrieve new or changed data."},{"id":2,"category":"Excel","title":"Regression analysis","content":"A form of statistical analysis used for forecasting. Regression analysis estimates the relationship between variables so that a given variable can be predicted from one or more other variables."},{"id":2,"category":"Excel","title":"Relative reference","content":"In a formula, the address of a cell based on the relative position of the cell that contains the formula and the cell referred to. If you copy the formula, the reference automatically adjusts. A relative reference takes the form A1."},{"id":2,"category":"Excel","title":"Remote reference","content":"A reference to data stored in a document from another program."},{"id":2,"category":"Excel","title":"Report filter","content":"A field that's used to filter a subset of data in a PivotTable or PivotChart into one page for further layout and analysis. You can either display a summary of all items in a report filter, or display one item at a time, which filters out the data for all other items."},{"id":2,"category":"Excel","title":"Report template","content":"An Excel template (.xlt file) that includes one or more queries or PivotTables that are based on external data. When you save a report template, Excel saves the query definition but doesn't store the queried data in the template."},{"id":2,"category":"Excel","title":"Result set","content":"The set of records returned when you run a query. You can see the result set of a query in Query, or you can return a result set to an Excel worksheet for further analysis."},{"id":2,"category":"Excel","title":"Row heading","content":"The numbered gray area to the left of each row. Click the row heading to select an entire row. To increase or decrease the height of a row, drag the line below the row heading."},{"id":2,"category":"Excel","title":"Row label","content":"A field that's assigned a row orientation in a PivotTable."},{"id":2,"category":"Excel","title":"R-squared value","content":"A number from 0 to 1 that reveals how closely the estimated values for the trendline correspond to your actual data. A trendline is most reliable when its R-squared value is at or near 1. Also known as the coefficient of determination."},{"id":2,"category":"Excel","title":"Scroll lock","content":"With scroll lock turned on, the arrow keys scroll the active sheet rather than make a different cell active. To turn scroll lock off or on, press the SCROLL LOCK key."},{"id":2,"category":"Excel","title":"Select All button","content":"The gray rectangle in the upper-left corner of a datasheet where the row and column headings meet. Click this button to select all cells on a datasheet."},{"id":2,"category":"Excel","title":"Series axis","content":"A chart axis that represents the depth dimension in a true 3-D chart. It displays the series names as arbitrary text values; it cannot display scaled numerical values."},{"id":2,"category":"Excel","title":"Series field","content":"A field that's displayed in the series area of a PivotChart. Items in a series field are listed in the legend and provide the names of the individual data series."},{"id":2,"category":"Excel","title":"Series lines","content":"In 2-D stacked bar and column charts, lines that connect the data markers in each data series that are used to emphasize the difference in measurement between each series."},{"id":2,"category":"Excel","title":"Shared workbook","content":"A workbook set up to allow multiple users on a network to view and make changes at the same time. Each user who saves the workbook sees the changes made by other users."},{"id":2,"category":"Excel","title":"Single-mapped cell","content":"A cell that has been linked to a non-repeating element in an XML map."},{"id":2,"category":"Excel","title":"Sort order","content":"A way to arrange data based on value or data type. You can sort data alphabetically, numerically, or by date. Sort orders use an ascending (1 to 9, A to Z) or descending (9 to 1, Z to A) order."},{"id":2,"category":"Excel","title":"Source areas","content":"The cell ranges that you consolidate in the destination area you specify. Source areas can be on any worksheet in a workbook, in other open or closed workbooks, or on Lotus 1-2-3 worksheets."},{"id":2,"category":"Excel","title":"Source data","content":"The list or table that's used to create a PivotTable or PivotChart. Source data can be taken from an Excel table or range, an external database or cube, or another PivotTable."},{"id":2,"category":"Excel","title":"Standard font","content":"The default text font for worksheets. The standard font determines the default font for the Normal cell style."},{"id":2,"category":"Excel","title":"Summary data","content":"For automatic subtotals and worksheet outlines, all rows or columns that summarize detail data. Summary data usually is adjacent to and below the detail data."},{"id":2,"category":"Excel","title":"Summary function","content":"A type of calculation that combines source data in a PivotTable or a consolidation table, or when you are inserting automatic subtotals in a list or database. Examples of summary functions include Sum, Count, and Average."},{"id":2,"category":"Excel","title":"System channel","content":"Used in a DDE conversation between applications to get information about the system, such as the current connections, open queries, and the status of the destination application."},{"id":2,"category":"Excel","title":"Table pane","content":"The area of the Query window that displays the tables in a query. Each table displays the fields from which you can retrieve data."},{"id":2,"category":"Excel","title":"Text box","content":"A rectangular object on a worksheet or chart, in which you can type text."},{"id":2,"category":"Excel","title":"Tick marks and tick-mark labels","content":"Tick marks are small lines of measurement, similar to divisions on a ruler, that intersect an axis. Tick-mark labels identify the categories, values, or series in the chart."},{"id":2,"category":"Excel","title":"Titles in charts","content":"Descriptive text that is automatically aligned to an axis or centered at the top of a chart."},{"id":2,"category":"Excel","title":"Total row","content":"A special row in an Excel table that provides a selection of aggregate functions useful for working with numerical data."},{"id":2,"category":"Excel","title":"Tracer arrows","content":"Arrows that show the relationship between the active cell and its related cells. Tracer arrows are blue when pointing from a cell that provides data to another cell, and red if a cell contains an error value, such as #DIV\/0!."},{"id":2,"category":"Excel","title":"Trendline label","content":"Optional text for a trendline, including either the regression equation or the R-squared value, or both. A trendline label can be formatted and moved; it cannot be sized."},{"id":2,"category":"Excel","title":"Up-down bars","content":"In line charts with multiple data series, bars that indicate the difference between data points in the first and last series."},{"id":2,"category":"Excel","title":"Value axis","content":"A chart axis that displays scaled numerical values."},{"id":2,"category":"Excel","title":"Value field","content":"A field from a source list, table, or database that contains data that is summarized in a PivotTable or PivotChart. A value field usually contains numeric data, such as statistics or sales amounts."},{"id":2,"category":"Excel","title":"Values area","content":"The part of a PivotTable that contains summary data. Values in each cell of the values area represent a summary of data from the source records or rows."},{"id":2,"category":"Excel","title":"Web query","content":"A query that retrieves data stored on your intranet or the Internet."},{"id":2,"category":"Excel","title":"What-if analysis","content":"A process of changing the values in cells to see how those changes affect the outcome of formulas on the worksheet. For example, varying the interest rate that is used in an amortization table to determine the amount of the payments."},{"id":2,"category":"Excel","title":"Workspace file","content":"A file that saves display information about open workbooks, so that you can later resume work with the same window sizes, print areas, screen magnification, and display settings. A workspace file doesn't contain the workbooks themselves."},{"id":2,"category":"Excel","title":"World Wide Web","content":"A system for navigating the Internet or through a collection of workbooks and other Office documents connected by hyperlinks and located on a network share, a company intranet or the Internet. When you use a Web browser, the Web appears as a collection of text, pictures, sounds, and digital movies."},{"id":1,"category":"DA","title":"ACID Test","content":"A test applied to data for atomicity, consistency, isolation and durability."},{"id":1,"category":"DA","title":"Aggregation","content":"A process of searching, gathering and presenting data."},{"id":1,"category":"DA","title":"Algorithm","content":"A mathematical formula or statistical process used to perform analysis of data."},{"id":1,"category":"DA","title":"Alpha Risk","content":"The maximum probability of making a Type I error. This probability is established by the experimenter and often set at 5%."},{"id":1,"category":"DA","title":"Alternative Hypothesis (Ha)","content":"Statement of a change or difference; assumed to be true if the null hypothesis is rejected."},{"id":1,"category":"DA","title":"Anomaly Detection","content":"The process of identifying rare or unexpected items or events in a dataset that do not conform to other items in the dataset and do not match a projected pattern or expected behavior. Anomalies are also called outliers, exceptions, surprises or contaminants and they often provide critical and actionable information."},{"id":1,"category":"DA","title":"Anonymization","content":"Making data anonymous; severing of links between people in a database and their records to prevent the discovery of the source of the records."},{"id":1,"category":"DA","title":"ANOVA","content":"One-way ANOVA is a generalization of the 2-sample t-test, used to compare the means of more than two samples to each other."},{"id":1,"category":"DA","title":"ANOVA Table","content":"The ANOVA table is the standard method of organizing the many calculations necessary for conducting an analysis of variance."},{"id":1,"category":"DA","title":"API (Application Program Interface)","content":"A set of programming standards and instructions for accessing or building web-based software applications."},{"id":1,"category":"DA","title":"Application","content":"Software that enables a computer to perform a certain task."},{"id":1,"category":"DA","title":"Artificial Intelligence","content":"The apparent ability of a machine to apply information gained from previous experience accurately to new situations in a way that a human would."},{"id":1,"category":"DA","title":"Batch Processing","content":"Batch data processing is an efficient way of processing high volumes of data where a group of transactions is collected over a period of time. Hadoop is focused on batch data processing."},{"id":1,"category":"DA","title":"Bayes Theorem","content":"A theorem based on conditional probabilities. It uses relevant evidence, also known as conditional probability, to determine the probability of an event, based on prior knowledge of conditions that might be related to the event."},{"id":1,"category":"DA","title":"Beta Risk","content":"The risk or probability of making a Type II error."},{"id":1,"category":"DA","title":"Big Data","content":"Big datarefers to datasets whose size is beyond the ability of typical database software tools to capture, store, manageand analyze."},{"id":1,"category":"DA","title":"Business Intelligence","content":"The general term used for the identification, extractionand analysis of data."},{"id":1,"category":"DA","title":"Cassandra","content":"A popular open source database management system managed by The Apache Software Foundation. Designed to handle large amounts of distributed data across commodity servers while providing a highly available service. It is a NoSQL solution that was initially developed by Facebook."},{"id":1,"category":"DA","title":"Classification Analysis","content":"A systematic process for obtaining important and relevant information about data (metadata) and assigning data to a particular group or class."},{"id":1,"category":"DA","title":"Clickstream Analytics","content":"The analysis of users’ web activity through the items they click on a page."},{"id":1,"category":"DA","title":"Cloud","content":"A broad term that refers to any internet-based application or service that is hosted remotely."},{"id":1,"category":"DA","title":"Cloud Computing","content":"A distributed computing system hosted and running on remote servers and accessible from anywhere on the internet."},{"id":1,"category":"DA","title":"Cluster Computing","content":"Computing using a ‘cluster’ of pooled resources of multiple servers. Getting more technical, we might be talking about nodes, cluster management layer, load balancingand parallel processing etc."},{"id":1,"category":"DA","title":"Clustering Analysis","content":"The process of identifying objects that are similar to each other and clustering them in order to understand the differences as well as the similarities within the data."},{"id":1,"category":"DA","title":"Coefficient of Variation","content":"Standard deviation normalized by the mean: ?\/?."},{"id":1,"category":"DA","title":"Columnar Database or Column-oriented Database","content":"A database that stores data by column rather than by row. In a row-based database, a row might contain a name, addressand phone number. In a column-oriented database, all names are in one column, addresses in anotherand so on. A key advantage of a columnar database is faster hard disk access."},{"id":1,"category":"DA","title":"Comparative Analysis","content":"Data analysis that compares two or more data sets or processes to detect patterns within very large data sets."},{"id":1,"category":"DA","title":"Confidence Interval","content":"A range of values which is likely to contain the population parameter of interest with a given level of confidence."},{"id":1,"category":"DA","title":"Continuous Data","content":"Data from a measurement scale that can be divided into finer and finer increments (e.g. temperature, time, pressure). Also known as variable data."},{"id":1,"category":"DA","title":"Correlation Analysis","content":"A means to determine a statistical relationship between variables, often for the purpose of identifying predictive factors among the variables. A technique for quantifying the strength of the linear relationship between two variables."},{"id":1,"category":"DA","title":"Dashboard","content":"A graphical representation of analyses performed by algorithms."},{"id":1,"category":"DA","title":"Dark Data","content":"All the data that is gathered and processed by enterprises but not used for any meaningful purposes."},{"id":1,"category":"DA","title":"Data","content":"A quantitative or qualitative value. Common types of data include sales figures, marketing research results, readings from monitoring equipment, user actions on a website, market growth projections, demographic informationand customer lists."},{"id":1,"category":"DA","title":"Data Aggregation","content":"The process of collecting data from multiple sources for the purpose of reporting or analysis."},{"id":1,"category":"DA","title":"Data Analyst","content":"A person responsible for the tasks of modelling, preparingand cleaning data for the purpose of deriving actionable information from it."},{"id":1,"category":"DA","title":"Data Analytics","content":"The process of examining large data sets to uncover hidden patterns, unknown correlations, trends, customer preferences and other useful business insights. The end result might be a report, an indication of statusor an action taken automatically based on the information received. Businesses typically use the following types of analytics:"},{"id":1,"category":"DA","title":"Data Architecture and Design","content":"How enterprise data is structured. The actual structure or design varies depending on the eventual end result required. Data architecture has three stages or processes: (1) conceptual representation of business entities, (2)the logical representation of the relationships among those entitiesand (3) the physical construction of the system to support the functionality."},{"id":1,"category":"DA","title":"Data as a Service (DaaS)","content":"Treat data as a product. DaaS providers use cloud solutions to give on-demand access of data to customers."},{"id":1,"category":"DA","title":"Data Center","content":"A physical facility that houses a large number of servers and data storage devices. Data centers might belong to a single organization or sell their services to many organizations."},{"id":1,"category":"DA","title":"Data Cleansing","content":"The process of reviewing and revising data to delete duplicate entries, correct misspelling and other errors, add missing data and provide consistency."},{"id":1,"category":"DA","title":"Data Ethical Guidelines","content":"Guidelines that help organizations be transparent with the data, ensuring simplicity, security and privacy."},{"id":1,"category":"DA","title":"Data Feed","content":"A means for a person to receive a stream of data such as a Twitter feed or RSS."},{"id":1,"category":"DA","title":"Data Governance","content":"A set of processes or rules that ensure data integrity and that data management best practices are met."},{"id":1,"category":"DA","title":"Data Integration","content":"The process of combining data from different sources and presenting it in a single view."},{"id":1,"category":"DA","title":"Data Integrity","content":"The measure of trust an organization has in the accuracy, completeness, timelinessand validity of the data."},{"id":1,"category":"DA","title":"Data Lake","content":"A large repository of enterprise-wide data in raw format. Supposedly data lakes makeit easy to access enterprise-wide data. However, you really need to know what you are looking for and how to process it and make intelligent use of it."},{"id":1,"category":"DA","title":"Data Mart","content":"The access layer of a data warehouse used to provide data to users."},{"id":1,"category":"DA","title":"Data Warehouse","content":"A repository for enterprise-wide data but in a structured format after cleaning and integrating with other sources. Data warehouses are typically used for conventional data (but not exclusively)."},{"id":1,"category":"DA","title":"Data Mining","content":"Finding meaningful patterns and deriving insights in large sets of data using sophisticated pattern recognition techniques. To derive meaningful patterns, data miners use statistics, machine learning algorithmsand artificial intelligence."},{"id":1,"category":"DA","title":"Data Modelling","content":"A data model defines the structure of the data for the purpose of communicating between functional and technical people to show data needed for business processes, or for communicating a plan to develop how data is stored and accessed among application development team members."},{"id":1,"category":"DA","title":"Data Scientist","content":"Someone who can make sense of big data by extracting raw data, massaging itand come up with insights. Skills needed are statistics, computer science, creativity, story-telling and understanding of business context."},{"id":1,"category":"DA","title":"Data Science","content":"A discipline that incorporates statistics, data visualization, computer programming, data mining, machine learningand database engineering to solve complex problems."},{"id":1,"category":"DA","title":"Data Set","content":"A collection of data, very often in tabular form."},{"id":1,"category":"DA","title":"Database","content":"A digital collection of data and the structure around which the data is organized. The data is typically entered into and accessed via a database management system."},{"id":1,"category":"DA","title":"Database Management System (DBMS)","content":"Software that collects and provides access to data in a structured format."},{"id":1,"category":"DA","title":"Demographic Data","content":"Data relating to the characteristics of a human population."},{"id":1,"category":"DA","title":"Discrete Data","content":"Data which is not measured on a continuous scale. Examples are binomial (pass\/fail), Counts per unit, Ordinal (small\/medium\/large)and Nominal (red\/green\/blue). Also known as attribute or categorical data."},{"id":1,"category":"DA","title":"Discriminant Analysis","content":"A statistical analysis technique used to predict cluster membership from labelled data."},{"id":1,"category":"DA","title":"Distributed File System","content":"A data storage system meant to store large volumes of data across multiple storage devices and will help decrease the cost and complexity of storing large amounts of data."},{"id":1,"category":"DA","title":"Empirical Model","content":"An equation derived from the data that expresses a relationship between the inputs and an output (Y=f(x))."},{"id":1,"category":"DA","title":"ETL (Extract, Transformand Load)","content":"The process of extractingraw data, transformingby cleaning\/enriching the data to make it fit operational needsand loadinginto the appropriate repository for the system’s use. Even though it originated with data warehouses, ETL processes are used while taking\/absorbing data from external sources in big data systems."},{"id":1,"category":"DA","title":"Event","content":"A set of outcomes of an experiment (a subset of the sample space) to which a probability is assigned."},{"id":1,"category":"DA","title":"Exploratory Analysis","content":"An approach to data analysis focused on identifying general patterns in data, including outliers and features of the data that are not anticipated by the experimenter’s current knowledge or preconceptions. EDA aims to uncover underlying structure, test assumptions, detect mistakesand understand relationships between variables."},{"id":1,"category":"DA","title":"External Data","content":"Data that exists outside of a system."},{"id":1,"category":"DA","title":"F-test","content":"A hypothesis test for comparing variances."},{"id":1,"category":"DA","title":"Fit","content":"The average outcome predicted by a model."},{"id":1,"category":"DA","title":"Grid Computing","content":"Connecting different computer systems from various locations, often via the cloud, to reach a common goal."},{"id":1,"category":"DA","title":"Hadoop","content":"An open source software framework administered by Apache that allows for storage, retrievaland analysis of very large data sets across clusters of computers."},{"id":1,"category":"DA","title":"High Performance Computing","content":"Using supercomputers to solve highly complex and advanced computing problems."},{"id":1,"category":"DA","title":"Histograms","content":"Representation of frequency of values by intervals."},{"id":1,"category":"DA","title":"In-database Analytics","content":"The integration of data analytics into the data storage layer."},{"id":1,"category":"DA","title":"In-memory Computing","content":"A technique of moving the working datasets entirely within a cluster’s collective memory and avoid writing intermediate calculations to disk. This results in very fast processing, storing and loading of data."},{"id":1,"category":"DA","title":"IoT (Internet of Things)","content":"The network of physical objects or “things”embedded with electronics, software, sensors and connectivity to enable it to achieve greater value and service by exchanging data with the manufacturer, operator and\/or other connected devices. Each thing is uniquely identifiable through its embedded computing system but is able to interoperate within the existing Internet infrastructure."},{"id":1,"category":"DA","title":"Juridical Data Compliance","content":"Use of data stored in a country must follow the laws of that country. Relevant when using cloud solutions with data stored in difference countries or continents."},{"id":1,"category":"DA","title":"Key Value Databases","content":"Storing data with a primary key, a uniquely identifiable record, which makes it easy and computationally efficient to look up."},{"id":1,"category":"DA","title":"Latency","content":"Any delay in a response or delivery of data from one point to another."},{"id":1,"category":"DA","title":"Load Balancing","content":"The process of distributing workload across a computer network or computer cluster to optimize performance."},{"id":1,"category":"DA","title":"Location Analytics","content":"Location analytics brings mapping and map-driven analytics to enterprise business systems and data warehouses. It allows you to associate geospatial information with datasets."},{"id":1,"category":"DA","title":"Location Data","content":"GPS data describing a geographical location."},{"id":1,"category":"DA","title":"Log File","content":"A file that a computer, networkor application creates automatically to record events that occur during operation. For example, the time a file is accessed."},{"id":1,"category":"DA","title":"Logistic Regression","content":"Investigates the relationship between response (Y’s) and one or more predictors (X’s) whereY’s are categorical, not continuous and X’s can be either continuous or categorical. Types of logistic regression are:"},{"id":1,"category":"DA","title":"Machine Learning","content":"A method of designing systems that can learn, adjust and improve based on the data fed to them. Using predictive and statistical algorithms that are fed to these machines, they learn and continually zero in on “correct” behavior and insights and they keep improving as more data flows through the system."},{"id":1,"category":"DA","title":"MapReduce","content":"A programming model for processing and generating large data sets. This model does two distinct things. First, the “Map”includes turning one dataset into another, more useful and broken down dataset made of parts called tuples. Tuples may typically be processed independently from each other across multiple processors. Second, “Reduce”takes all of the broken down, processed tuples and combines their output into a usable result. The result is a practical breakdown of processing."},{"id":1,"category":"DA","title":"Massively Parallel Processing (MPP)","content":"Using many different processors (or computers) to perform certain computational tasks at the same time."},{"id":1,"category":"DA","title":"Mean","content":"The weightedaverage of data. The population mean is denoted by ? (Greek letter mu) and the sample mean is denoted by x?."},{"id":1,"category":"DA","title":"Median","content":"The middle value of a data set when arranged in order of magnitude."},{"id":1,"category":"DA","title":"Metadata","content":"Data about data; it gives information about what the data is about. For example, where data points were collected."},{"id":1,"category":"DA","title":"Mode","content":"The measurement that occurs most often in a data set."},{"id":1,"category":"DA","title":"Multi-dimensional Databases","content":"A database optimized for data online analytical processing (OLAP) applications and for data warehousing."},{"id":1,"category":"DA","title":"Naïve Bayes","content":"A classification technique based on Bayes Theorem with an assumption of independence among predictors. In simple terms, it assumes that the presence of a particular feature in a class is unrelated to the presence of any other feature."},{"id":1,"category":"DA","title":"Network Analysis","content":"Analyzing connections between nodes in a network and the strength of their ties."},{"id":1,"category":"DA","title":"Neural Network","content":"Models inspired by the real-life biology of the brain. These are used to estimate mathematical functions and facilitate different kinds of learning algorithms. Deep Learning is a similar term and is generally seen as a modern buzzword, rebranding the Neural Network paradigm for the modern day."},{"id":1,"category":"DA","title":"Normal Distribution","content":"The most important continuous probability distribution in statistics is the normal distribution (a.k.a. Gaussian distribution). The normal distribution is the familiar bell curve. Once m and s are specified, the entire curve is determined."},{"id":1,"category":"DA","title":"NoSQL (Not ONLY SQL)","content":"A broad class of database management systems identified by non-adherence to the widely used relational database management system model. NoSQL databases are not built primarily on tablesand generally do not use SQL for data manipulation. Database management systems that are designed to handle large volumes of data and are often well-suited for big data systems because of their flexibility and distributed-first architecture needed for large unstructured databases."},{"id":1,"category":"DA","title":"Null Hypothesis (H0)","content":"Statement of no change or difference; assumed to be true until sufficient evidence is presented to reject it."},{"id":1,"category":"DA","title":"One Sample T-test","content":"Statistical test to compare the mean of one sample of data to a target. Uses the t-distribution"},{"id":1,"category":"DA","title":"Operational Databases","content":"Databases that carry out regular operations of an organization that are generally very important to the business. They typically use online transaction processing that allows them to enter, collect and retrieve specific information about the organization."},{"id":1,"category":"DA","title":"Optimization Analysis","content":"The process of finding optimal problem parameters subject to constraints. Optimization algorithms heuristically test a large number of parameter configurations in order to find an optimal result, determined by a characteristic function (also called a fitness function)."},{"id":1,"category":"DA","title":"Outlier Detection","content":"An object that deviates significantly from the general average within a dataset or a combination of data. It is numerically distant from the rest of the data and therefore indicates that something unusual and generally requires additional analysis."},{"id":1,"category":"DA","title":"Paired T-test","content":"A test used to compare the average difference between two samples of data that are linked in pairs. Special case of the 1-sample t-test. Uses the t-distribution."},{"id":1,"category":"DA","title":"Pattern Recognition","content":"Identifying patterns in data via algorithms to make predictions about new data coming from the same source."},{"id":1,"category":"DA","title":"Pig","content":"A data flow language and execution framework for parallel computation."},{"id":1,"category":"DA","title":"Population","content":"A dataset that consists of all the members of some group. Descriptive parameters (such as ?, ?) are used to describe the population."},{"id":1,"category":"DA","title":"Power (1-beta)","content":"The ability of a statistical test to detect a real difference when there is one;the probability of correctly rejecting the null hypothesis. Determined by alpha and sample size."},{"id":1,"category":"DA","title":"Predictive Modelling","content":"The process of developing a model that will most likely predict a trend or outcome."},{"id":1,"category":"DA","title":"Probability","content":"The likelihood of a given event’s occurrence, which is expressed as a number between 1 and 0."},{"id":1,"category":"DA","title":"Probability Distribution","content":"A statistical function that describes all the possible values and likelihoods that a random variable can take within a given range. Probability distributions may be discrete or continuous."},{"id":1,"category":"DA","title":"Public Data","content":"Public information or data sets that were created with public funding."},{"id":1,"category":"DA","title":"Query","content":"Asking for information to answer a certain question."},{"id":1,"category":"DA","title":"R","content":"An open source programming language used for statistical computing and graphics. It is a GNU project which is similar to the S language. R provides a wide variety of statistical (linear and nonlinear modelling, classical statistical tests, time-series analysis, classification, clustering, etc.) and graphical techniquesand is highly extensible. It is one of the most popular languages in data science."},{"id":1,"category":"DA","title":"Range","content":"Difference between the largest and smallest measurement in a data set."},{"id":1,"category":"DA","title":"Real Time Data","content":"Data that is created, processed, stored, analyzed and visualized within milliseconds."},{"id":1,"category":"DA","title":"Regression Analysis","content":"A modelling technique used to define the association between variables. It assumes a one-way causal effect from predictor variables (independent variables) to a response of another variable (dependent variable). Regression can be used to explain the past and predict future events."},{"id":1,"category":"DA","title":"Residual","content":"The difference between reality (an actual measurement) and the fit (model output)."},{"id":1,"category":"DA","title":"Sample","content":"A data set which consists of only a portion of the members from some population. Sample statistics are used to draw inferences about the entire population from the measurements of a sample."},{"id":1,"category":"DA","title":"Scalability","content":"The ability of a system or process to maintain acceptable performance levels as workload or scope increases."},{"id":1,"category":"DA","title":"Semi-structured Data","content":"Data that is not structured by a formal data model, but provides other means of describing the data hierarchies (tags or other markers)."},{"id":1,"category":"DA","title":"Sentiment Analysis","content":"The application of statistical functions and probability theory to comments people make on the web or social networks to determine how they feel about a product, service or company."},{"id":1,"category":"DA","title":"Significant Difference","content":"The term used to describe the results of a statistical hypothesis test where a difference is too large to be reasonably attributed to chance."},{"id":1,"category":"DA","title":"Single-variance Test (Chi-square Test)","content":"Compares the variance of one sample of data to a target. Uses the Chi-square distribution."},{"id":1,"category":"DA","title":"Software as a Service (SaaS)","content":"Enables vendors to host an application and make it available via the internet (cloud servicing). SaaS providers provide services over the cloud rather than hard copies."},{"id":1,"category":"DA","title":"Spark (Apache Spark)","content":"A fast, in-memory open source data processing engine to efficiently execute streaming, machine learning or SQL workloads that require fast iterative access to datasets. Spark is generally a lot faster than MapReduce."},{"id":1,"category":"DA","title":"Spatial Analysis","content":"Analyzing spatial data such geographic data or topological data to identify and understand patterns and regularities within data distributed in a geographic space."},{"id":1,"category":"DA","title":"SQL (Structured Query Language)","content":"A programming language for retrieving data from a relational database."},{"id":1,"category":"DA","title":"Standard Deviation","content":"The positive square root of the variance:"},{"id":1,"category":"DA","title":"Stream Processing","content":"Stream processing is designed to act on real-time and streaming data with “continuous”queries. Combined with streaming analytics (i.e. the ability to continuously calculate mathematical or statistical analytics on the fly within the stream), stream processing solutions are designed to handle high volumes in real time."},{"id":1,"category":"DA","title":"Structured Data","content":"Data that is organized according to a predetermined structure."},{"id":1,"category":"DA","title":"Sum of Squares","content":"In ANOVA, the total sum of squares helps express the total variation that can be attributed to various factors. From the ANOVA table, %SS is the Sum of Squares of the Factor divided by the Sum of Squares Total. Similar to R2 in Regression."},{"id":1,"category":"DA","title":"Terabyte","content":"1024 gigabytes. A terabyte can store approximately 300 hours of high-definition video."},{"id":1,"category":"DA","title":"Test for Equal Variance (F-test)","content":"Compares the variance of two samples of data against each other. Uses the F distribution."},{"id":1,"category":"DA","title":"Test Statistic","content":"A standardized value (Z, t, F, etc.) which represents the likelihood of H0and is distributed in a known manner such that the probability for this value can be determined."},{"id":1,"category":"DA","title":"Time Series Analysis","content":"Analysis of well-defined data measured at repeated measures of time to identify time based patterns."},{"id":1,"category":"DA","title":"Topological Data Analysis","content":"Analysis techniques focusing on the theoretical shape of complex data with the intent of identifying clusters and other statistically significance trends that may be present."},{"id":1,"category":"DA","title":"Transactional Data","content":"Data that relates to the conducting of business, such as accounts payable and receivable dataor product shipments data."},{"id":1,"category":"DA","title":"Two Sample t-test","content":"A statistical test to compare the means of two samples of data against each other. Uses the t-distribution."},{"id":1,"category":"DA","title":"Type I Error","content":"The error that occurs when the null hypothesis is rejected when, in fact, it is true."},{"id":1,"category":"DA","title":"Type II Error","content":"The error that occurs when the null hypothesis is not rejected when it is, in fact, false."},{"id":1,"category":"DA","title":"Unstructured Data","content":"Data that has no identifiable structure, such asemail message text, social media posts, audio files (recorded human speech, music),etc."},{"id":1,"category":"DA","title":"Variance","content":"The average squared deviation for all values from the mean:"},{"id":1,"category":"DA","title":"Variety","content":"The different types of data available to collect and analyze in addition to the structured data found in a typical database. Categories include machine generated data, computer log data, textual social media information, multimedia social and other information."},{"id":1,"category":"DA","title":"Velocity","content":"The speed at which data is acquired and used. Not only are companies and organizations collecting more and more data at a faster rate, they want to derive meaning from that data as soon as possible, often in real time."},{"id":1,"category":"DA","title":"Veracity","content":"Ensuring that data used in analytics is correct and precise."},{"id":1,"category":"DA","title":"Visualization","content":"A visual abstraction of data designed for the purpose of deriving meaning or communicating information more effectively. Visuals created are usually complex, but understandable in order to convey the message of data."},{"id":5,"category":"BI","title":"Agile","content":"A methodology cribbed from software development that now sees application in many areas of business. Agile aims to help teams respond to unpredictability through incremental, iterative work cadences and shortened feedback loops (e.g. using short, daily meetings where project workers describe what they are working on.) Agile methodologies are an alternative to waterfall, or traditional sequential development."},{"id":5,"category":"BI","title":"Analysis Services","content":"Also known as Microsoft SQL Server Analysis Services, SASS, and sometimes MSAS. Analysis Services is an online analytical data engine used in decision support and business analytics. It provides the analytical data for business reports and client applications such as Power BI, Excel, Reporting Services reports, and other data visualization tools. Analysis Services are used by organizations to analyze and make sense of information that could be spread out across multiple databases, or in disparate tables or files."},{"id":5,"category":"BI","title":"Analytics","content":"The discovery, interpretation, and communication of meaningful patterns in data. They are essentially the backbone of any data-driven decision making."},{"id":5,"category":"BI","title":"Business Analytics (BA)","content":"Refers to the skills, technologies, and practices for investigation of past business performance to gain insight and drive business planning. It focuses on developing new insights and understanding of business performance based on data and statistical methods. While business intelligence (BI) focuses on a consistent set of metrics to both measure past performance and guide business planning, business analytics is focused on developing new insights and understanding based on statistical methods and predictive modeling.\nFurthermore, while BI methods such as querying, reporting, OLAP, and alert tools answer questions such as"},{"id":5,"category":"BI","title":"Business Analyst","content":"Someone who analyzes an organization or business domain (real or hypothetical) and documents its processes and systems, assesses the business model, and determines integration with technology. Their solutions can be the use of technology architecture, tools, or software application. In a BI project, this person is often responsible for determining business needs and translating them into architectural data and application requirements."},{"id":5,"category":"BI","title":"Back-End","content":"In software, ‘back-end’ applications or programs interact directly with resources or databases without directly interfacing with an end user. To access back-end processes, users will usually do so via a user interface situated on the ‘front-end.’ The presentation layer is the front–end, whereas the access layer is known as the back-end."},{"id":5,"category":"BI","title":"BI application designer","content":"Someone responsible for designing the initial reporting templates and dashboards in the front-end applications. They generally require a combined enthusiasm for data visualization, user experience design, and applications reporting. Typically, BI application designers become the source for ongoing front-end BI application support."},{"id":5,"category":"BI","title":"BI Project Sponsor","content":"Ideally, a project sponsor is an executive level individual who understands the importance of BI projects, has compelling business motivation, and can help drive results. This person will be the project’s ultimate client and its strongest advocate. Not involved in the day to day of a project, but instead, they provide oversight, direction, and momentum."},{"id":5,"category":"BI","title":"Big Data","content":"This term is rapidly achieving buzzword status—but colloquially, it refers to an amount of data so impossibly large that it cannot be parsed by traditional techniques. According to research firm Gartner, “‘Big Data’ is high-volume, high-velocity, and\/or high-variety information assets that demand cost-effective, innovative forms of information processing that enable enhanced insight, decision-making, and process automation.”"},{"id":5,"category":"BI","title":"Business Driver","content":"This term can refer to either a resource, process, or condition that is essential to the growth and continued success of a business. For an example in terms of a BI project, when the sponsor is too far removed from the project team, a business driver is helpful. The driver typically becomes responsible for the less strategic BI responsibilities. This role is usually filled by a middle manager, but possesses the same characteristics as the sponsor."},{"id":5,"category":"BI","title":"Business Intelligence (BI)","content":"A catchall term encompassing a variety of tools, applications and methodologies that enable organizations to collect data from internal systems and external sources. BI can be used to prepare data for analysis, develop and run queries, and create reports, dashboards and visualizations with the end goal of providing results to decision makers and end users."},{"id":5,"category":"BI","title":"Business Lead","content":"A mid-to-senior level resource who understands both the business and technical side of a company well enough to communicate between the two. Within the context of a BI project, they understand the requirements, obstacles, and issues of each to make decisions on various courses of action. Additionally, this person should be highly involved in a BI project – communicating with the project manager constantly. Sometimes the business driver fills this role."},{"id":5,"category":"BI","title":"Business Owners","content":"The business owner role needs to be filled from the business user groups by enthusiastic fans of the BI project who are also subject matter experts in their fields. Each set of business users from within the organization that will be using the BI tool (finance, operations, HR, etc.) should appoint a business owner. Business user involvement is critical and care should be taken to keep them involved from the very beginning of the project. Without business owners and users, a BI project is merely an academic technical exercise."},{"id":5,"category":"BI","title":"Business User","content":"A user of a service or product, who may not necessarily have contact with the supplier\/provider—therefore existing at the end of the data ‘supply chain’. i.e. a content management system (CMS) end user, or an accountant entering purchase orders into an enterprise resource planning (ERP) system."},{"id":5,"category":"BI","title":"Collaborative Business Intelligence, or Collaborative BI","content":"Is the marriage of traditional business intelligence tactics with tools like social networking, wikis, or blogs, to enhance the collaborative problem-solving nature of BI. Microsoft SharePoint is an example of a popular collaborative BI product."},{"id":5,"category":"BI","title":"Cube","content":"Multi-dimensional sections of data built from tables and fields in your database. Cubes contain calculations and formulae and are often grouped around specific business functions such as sales, finance, purchasing, inventory, etc. Each cube contains contextual, pertinent, and useful metrics for that particular area of the business."},{"id":5,"category":"BI","title":"Dashboard","content":"Provides at-a-glance statistical analysis and historical trends of an organization’s key performance indicators (KPI’s), presented in easily digestible, graphical representations. For example, a human resources dashboard may show numbers related to staff recruitment, retention, and composition. Whereas a marketing dashboard may show numbers related to inbound web traffic, search volume, and lead velocity."},{"id":5,"category":"BI","title":"Data Architect","content":"A practitioner of data architecture, an information technology discipline concerned with designing, creating, deploying, and managing an organization’s data architecture. This person is usually responsible for designing the Extract, Transform, and Load (ETL) process and building the structure (dimensional model) that the data will reside in after it goes through the ETL process. Data architects also tie together the required technical functionality for the BI project. Multiple skills are needed"},{"id":5,"category":"BI","title":"Data Architecture","content":"A set of rules, policies, standards and models that govern and define the type of data collected and how it is used, stored, managed, and integrated within an organization and its database systems."},{"id":5,"category":"BI","title":"Database","content":"In its most generic sense, a database is collection of information that is organized so that it can be accessed, managed, and updated. Usually stored in a computer or on a server, the data could be images, numeric, scripts, full-text, etc. characterizing almost any kind of information. In the context of business intelligence (BI), databases represent systems like Microsoft Dynamics, Excel, CRM, Salesforce, etc. that contain aggregations of data records or files, such as sales transactions, product catalogs and inventories, and customer profiles. Information is input and stored in the database, and a BI solution is required to get a meaningful, organized and informing format of that data out. See also relational database and multidimensional database."},{"id":5,"category":"BI","title":"Database Management System (DBMS)","content":"A computer software application that interacts with the user, other applications, and the database itself to capture and analyze data. A general-purpose DBMS is designed to allow the definition, creation, querying, update, and administration of databases."},{"id":5,"category":"BI","title":"Data Cleansing","content":"The process of detecting and correcting faulty records, leading to highly accurate BI-informed decisions, as enormous databases and rapid acquisition of data can lead to inaccurate or faulty data that impacts the resulting BI and analysis. Correcting typographical errors, de-duplicating records, and standardizing syntax are all examples of data cleansing."},{"id":5,"category":"BI","title":"Data Feed or Live Data Feed","content":"A mechanism for users to receive updated data from data sources. It is commonly used by real-time applications in point-to-point settings as well as on the Internet."},{"id":5,"category":"BI","title":"Data Intelligence","content":"Focuses on internal data used for future endeavors and is sometimes mistakenly labelled as business intelligence. Whereas business intelligence involves organizing, rather than just gathering data to make it useful and applicable to the business’s practices, data intelligence focuses on extrapolating data to assess future services or investments."},{"id":5,"category":"BI","title":"Data Manager","content":"Any team requires management, and a data science team is no different. On a data science or analysis team, the data manager acts as the middleperson between technical team members and strategic management. Because of this, it’s ideal that the data manager possess a technical IT background with strategic experience."},{"id":5,"category":"BI","title":"Data management","content":"The process by which data is acquired, validated, stored, protected, and processed. In turn, its accessibility, reliability, and timeliness is ensured to satisfy the needs of the data users. Data management properly oversees the full data lifecycle needs of an enterprise."},{"id":5,"category":"BI","title":"Data Mining","content":"Refers to the process of analyzing large batches of data to find patterns and instances of statistical significance. By utilizing software to look for patterns in large batches of data, businesses can learn more about their customers and develop more effective strategies for acquisition, as well as increase sales and decrease overall costs."},{"id":5,"category":"BI","title":"Data Model","content":"Defines how data is structured, related, and standardized for the purpose of extracting meaningful insight. Businesses can utilize multiple data models (like you do with Microsoft’s Power BI) to ensure all relevant data is included."},{"id":5,"category":"BI","title":"Data Modeling","content":"Refers to the process of defining, analyzing, and structuring data within data models."},{"id":5,"category":"BI","title":"Data Source","content":"The source of the data. It can be a file, a particular database on a DBMS, or even a live data feed. The purpose of a data source is to gather all of the technical information needed to access the data—driver name, network address, network software, etc.—into a single place and hide it from the business user. The user should be able to look at a list that includes Payroll, Inventory, and Personnel, choose Payroll from the list, and have the BI application connect to the payroll data. This is completed without the user knowing where the payroll data resides or how the application got to it."},{"id":5,"category":"BI","title":"Data Visualization","content":"The practice of structuring and arranging data within a visual context to help users understand it. Patterns and trends that might be unrecognizable to the layman in text-based data can be easily viewed and digested by end users with the help of data visualization software."},{"id":5,"category":"BI","title":"Data Warehouse","content":"A large store of data drawing from a wide range of sources that can be processed, split, and analyzed to extract insights that guide management decisions. Data warehouses are typically relational databases that contain historical data and are designed for query and analysis."},{"id":5,"category":"BI","title":"Data Warehousing","content":"The process of aggregating data from disparate sources for the purpose of building a data warehouse. Data warehousing involves design, development, testing, deployment, operations, impact analysis, and change management."},{"id":5,"category":"BI","title":"Data Warehouse Automation (DWA)","content":"Uses technology to gain efficiencies and improve effectiveness in data warehousing processes. The idea behind DWA is to automate each part of the data warehouse lifecycle that can be automated so that the project team can focus on the parts that require more intellectual input than raw technological horsepower. DWA can help reduce the time to implementation for BI projects, reduce annual expenditure on BI, as well as improve success rates. For more information on DWA, see this post."},{"id":5,"category":"BI","title":"Data Warehouse Developer","content":"Primary role is to develop and deploy code. They receive direction from the ETL architect and directly build ETL functions. Expertise and experience in ETL are needed but that can vary depending on which ETL tool(s) are used."},{"id":5,"category":"BI","title":"Database Administrator (DBA)","content":"This role includes capacity planning, installation, configuration, database design, migration, performance monitoring, security, troubleshooting, as well as backup and data recovery. They use specialized software to store and organize data, and are often on-call to provide general database support to the BI delivery team."},{"id":5,"category":"BI","title":"Data Analysis Expressions (DAX)","content":"Provides a specialized syntax for querying Analysis Services. DAX includes some of the functions that are used in Excel formulas as well as additional functions that are designed to work with relational data and perform dynamic aggregation. DAX can compute values for seven different data types"},{"id":5,"category":"BI","title":"Dimension","content":"A category that can be used to arrange data by facts and measures for data dicing (grouping) and slicing (filtering) purposes. Commonly used dimensions are people, products, places, and time."},{"id":5,"category":"BI","title":"Dimension Table","content":"In a data warehouse, a dimension table is a companion to a fact table. Dimension tables contain descriptive fields that are traditionally textual. Dimension tables are related to fact tables (which contain measures) through the use of keys (such as surrogate keys)."},{"id":5,"category":"BI","title":"Drillthrough\/Drill down","content":"In BI terminology, ‘drill down’ refers to moving from high level to detailed, transactional data by focusing in on something (a particular number in a report, for example). In a visualization environment (such as Jet Reports), “drilling down” may involve clicking on some representation in order to reveal more detail."},{"id":5,"category":"BI","title":"Data Analysis Expressions (DAX)","content":"Refers to the process by which data is"},{"id":5,"category":"BI","title":"Executive BI","content":"The practice of collecting, analyzing, and visualizing data to deliver key insights to the executive level resources that help drive business change."},{"id":5,"category":"BI","title":"Executive Dashboard","content":"Allows the executive team to gain instant insight into the big picture of an entire organization from finance and operations to sales and marketing. Executive Dashboards (such as those Jet Reports delivers through Jet Analytics) are fully customizable to display the data that matters to your executive team."},{"id":5,"category":"BI","title":"Extract, Transform, Load (ETL)","content":"Refers to the process by which data is"},{"id":5,"category":"BI","title":"Fact Table","content":"Consist of measurements, metrics, or facts of a business process. They are located at the center of a star schema or a snowflake schema surrounded by dimension tables. Fact tables provide the (usually) additive values that act as independent variables by which dimensional attributes are analyzed. Fact tables are often defined by their grain. The grain of a fact table represents the most atomic level by which the facts may be defined. For example, the grain of a sales fact table might be stated as “Sales volume by Day by Product by Store”."},{"id":5,"category":"BI","title":"Field Transformation","content":"These enable an administrator to transform raw field input into standardized values that are more meaningful to an organization. Transformations are controlled by rules and can be configured for use in queries. For example, if a measurement variable does not fit a normal distribution or has greatly different standard deviations in different groups, field transformation may be necessary—the transformation of data at the field type level. Data transformations are an important tool for proper statistical analysis; to those with a limited knowledge of statistics, however, they may seem a bit fishy, a form of playing around with your data in order to get the answer you want. It is therefore essential that you be able to defend your use of field and data transformations, as well as document them."},{"id":5,"category":"BI","title":"Financial Reporting","content":"The process of producing statements that disclose an organization’s financial status to management, investors, and the government. For Financial Reporting best practices, see our ‘Do This, Not That"},{"id":5,"category":"BI","title":"Front-End","content":"In software, contrary to the ‘back-end’, the ‘front-end’ is the portion of a program or device that interfaces directly with the end user via a user interface (UI), and communicates with the back-end."},{"id":5,"category":"BI","title":"Full Load","content":"A means of reading and updating all records in a data source during warehouse loading. When it comes to loading data into a data warehouse, there are two main techniques"},{"id":5,"category":"BI","title":"Governed Data","content":"Information and data processes that are managed, controlled and secured by a governing department, typically IT, to fit business rules and standards before users may access it. This helps to ensure data integrity; in effect, users will only be working with trusted, credible data."},{"id":5,"category":"BI","title":"Hierarchy","content":"Refers to a means of organizing different levels of a dimension by granularity; usually from largest to smallest. For a date, a typical hierarchy would be organized by year, quarter, month and day. Country, state, city and customer is another example of hierarchy levels within a cube."},{"id":5,"category":"BI","title":"Human Resources Dashboard (HR dashboard)","content":"Analyzes and presents enterprise data for the purpose of displaying meaningful HR KPIs. Employee Satisfaction Index, number of FTEs, turnover rate, employee benefit usage, and cost per employee are examples of data points that can be visualized and displayed via an HR dashboard."},{"id":5,"category":"BI","title":"In Memory","content":"A database management system that primarily relies on computer memory for data storage, contrasted with database management systems that employ a disk storage mechanism. The benefits of using an “in-memory database” system (or IMDB—not to be confused with the ‘Internet Movie Database’) are that it eliminates seek time when querying the data. This provides faster, and more predictable, performance than disk—highly beneficial when computing and analyzing vast amounts of data."},{"id":5,"category":"BI","title":"Incremental Load","content":"Contrasted with full load, incremental load is a means of data warehouse loading that involves only loading new or updated records. Incremental loads are useful because they run very efficiently when compared to full loads and allow for more frequent updating of the data warehouse and cubes, particularly with large data sets."},{"id":5,"category":"BI","title":"Index","content":"A data structure that stores the values for a specific column in a table. Indexing is a way of sorting a number of records on multiple fields. For example, creating an index on a field in a table creates another data structure which holds the field value, and pointer to the record it relates to. This index structure is then sorted, allowing rapid Binary Searches to be performed on it."},{"id":5,"category":"BI","title":"In-Memory Analytics","content":"Refers to the process of querying data when it resides in computer memory (such as RAM) rather than on physical storage device, such as hard drives. In-memory querying is incrementally faster than the alternatives, resulting in expedited business decisions driven by data from business intelligence applications. As the cost of RAM continues to decline, large-scale in-memory analytics is becoming a more feasible option for many organizations."},{"id":5,"category":"BI","title":"Inmom Approach","content":"A top-down methodology for data warehousing. It states that the data warehouse should be modeled using normalization rules. Tables are grouped together by subject areas that reflect general data categories (e.g., data on customers, products, finance, etc.). The normalized structure divides data into entities, which creates several tables in a relational database. When applied in large enterprises, the result is dozens of tables that are linked together by a web of joins."},{"id":5,"category":"BI","title":"Jet Data Manager (JDM)","content":"The Data Warehouse Automation (DWA) platform for Jet Analytics. With the JDM you can transform and validate data from different data sources, consolidate them in a data warehouse, and build Online Analytical Processing (OLAP) cubes using a drag-and-drop interface. When you execute or deploy a BI project, the Jet Data Manager also automatically generates the underlying SQL code of your solution. With the Jet Data Manager you can access data from a variety of sources including ERP systems (such as Microsoft Dynamics), CRM applications, SQL databases, spreadsheets, and plain text files. The data is stored in a data warehouse in Microsoft SQL Server and can be viewed in your preferred front-end application such as Excel, Microsoft’s Power BI, the Jet Analytics mobile dashboard builder, or other third party applications."},{"id":5,"category":"BI","title":"Jet Analytics (Previously Jet Enterprise)","content":"A corporate analytics and reporting platform that delivers fast and flexible dashboards and financial reports in Excel on the web. Offers pre-built cubes, data warehouse, dashboards, and more. Learn more about Jet Analytics."},{"id":5,"category":"BI","title":"Jet Basics (Previously Jet Express)","content":"A free extension included with Microsoft Dynamics NAV and GP to create basic reports inside of Excel (Jet Basics) or Word (Jet Express for Word). Created in collaboration with Microsoft. Learn more about Jet Basics or Word."},{"id":5,"category":"BI","title":"Jet Reports (Previously Jet Professional)","content":"A fast, flexible financial and business reporting solution inside of Excel. Allows users to drill down on the numbers directly from Excel and access reports anywhere on the web. Learn more about Jet Reports.\njoins"},{"id":5,"category":"BI","title":"Joins A means for combining fields from two tables by using values common to each. It’s possible to combine fields by utilizing different kinds of joins, such as","content":"– inner join"},{"id":5,"category":"BI","title":"Kimball Approach","content":"A bottom-up methodology for data warehousing (contrasted with the Inmon approach, which is top-down). Using the Kimball approach, dimensional data marts are first created to provide reporting and analytical capabilities for specific business areas such as “Sales” or “Production”, then combined into a broader data warehouse. It is the most frequently used methodology, especially if you are using the Microsoft BI stack."},{"id":5,"category":"BI","title":"Key Performance Indicator (KPI)","content":"Business metrics used to evaluate factors that are crucial to organizational success. KPIs differ per organization; business KPIs may be net revenue or a customer loyalty metric, whereas HR KPIs may involve employee turnover rates, employee satisfaction and headcount."},{"id":5,"category":"BI","title":"Lead and Lag","content":"Analytical functions that are used to calculate the difference between rows in a table. LEAD calculates the difference between the current row and the following row, while LAG calculates the difference between the current row and the previous row."},{"id":5,"category":"BI","title":"Level","content":"A grouping within a dimension. For example, customers can be grouped by city or country. When grouped in this way, customer, city and country are categorized as different levels within a cube. Similarly, dates can have different levels in a BI cube (day, month, quarter, year, is a common example.)"},{"id":5,"category":"BI","title":"Many-to-Many Relationships","content":"Refers to a relationship between tables in a database when a parent row in one table contains several child rows in the second table, and vice versa. Many-to-many relationships are often tricky to represent. However, one or more rows in a table can be related to 0, 1, or many rows in another table. In a many-to-many relationship between Table A and Table B, each row in Table A is linked to 0, 1, or many rows in Table B and vice versa. A 3rd table called a mapping table is required in order to implement such a relationship."},{"id":5,"category":"BI","title":"Marketing Dashboard","content":"Analyzes and presents enterprise data for the purpose of displaying meaningful marketing KPIs. Lead acquisition, website conversion rate, cost per lead, web traffic, and more are examples of data points that can be visualized and displayed via a marketing dashboard."},{"id":5,"category":"BI","title":"Multidimensional expressions (or MDX)","content":"A querying language for OLAP or relational databases, with syntax similar to spreadsheet formulae. Due to its simplicity and straightforward syntax, it has quickly become the standard for OLAP systems over the more complex SQL."},{"id":5,"category":"BI","title":"Measure","content":"A calculated numerical value. It can be a sum, a count, an average, a percentage, etc. Examples of measures would be gross sales, profit, profit percentage. In cubes, many measures are pre-calculated, providing extremely fast performance when analyzing data. Examples of measures in a sales cube may include Sales Amount, Profit YTD, Average Unit Cost, Document Count, etc."},{"id":5,"category":"BI","title":"Member(s)","content":"Users with preconfigured access to a database based on roles."},{"id":5,"category":"BI","title":"Metadata","content":"A set of data that gives information about other data. Examples of relational-database metadata include"},{"id":5,"category":"BI","title":"Metrics","content":"Quantifiable measures used to track, monitor, and gauge the results and success of various business processes. Metrics are meant to communicate a company’s progression toward certain long and short term objectives. This often requires the input of key stakeholders in the business as to which metrics matter to them."},{"id":5,"category":"BI","title":"Microsoft BI Stack","content":"Microsoft’s suite of business intelligence tools that cater to the individual, team, and enterprise level depending on the needs of the organization. This encompasses SQL servers, OLAP cubes, SharePoint, PerformancePoint, Excel, and Dynamics. In conjunction, these tools can be combined to collect, store, analyze, segment, and visualize data and generate meaningful insights to drive business decisions."},{"id":5,"category":"BI","title":"Mobile Analytics","content":"Refers to the accessibility of meaningful and pointed data, dashboards, and reports for end users on mobile devices, such as tablets and smart phones."},{"id":5,"category":"BI","title":"Mobile Dashboards","content":"A business intelligence dashboard that can be accessed via a mobile device. Given the gravitation of business to an always-on, anywhere mentality, business leaders are embracing mobile dashboards and mobile analytics as a means of effectively accessing, analyzing, and optimizing data from mobile devices. Jet is an example of a leading mobile dashboard solution."},{"id":5,"category":"BI","title":"Multidimensional Database (MDB)","content":"A type of database that is optimized for data warehouses and online analytical processing. Multidimensional data solutions utilize cube structures for analyzing data across numerous dimensions. They are composed of cubes and dimensions that can be annotated and extended to support complex query constructions. BI developers create cubes to support fast response times, and to provide a single data source for business reporting."},{"id":5,"category":"BI","title":"Online Analytical Processing (OLAP)","content":"A powerful technology for data discovery, including capabilities for limitless report viewing, complex analytical calculations, and predictive “what if” scenario (budget, forecast) planning. OLAP performs multidimensional analysis of business data and provides the capability for complex calculations, trend analysis, and sophisticated data modeling. Typical applications of OLAP include business reporting for sales, marketing, management reporting, business process management (BPM), budgeting and forecasting as well as financial reporting."},{"id":5,"category":"BI","title":"OLAP Cube","content":"A method of storing data in a multidimensional form, generally for reporting purposes. In OLAP cubes, data measures are categorized by dimensions. OLAP cubes are often pre-summarized across dimensions to drastically improve query time, and accuracy, from relational databases."},{"id":5,"category":"BI","title":"One version of the truth (or ‘single version of the truth’; or SVOT","content":"A technical concept describing the business analysis ideal of having either a single centralized database (data warehouse), or at least a distributed synchronized database, which stores all of an organization’s data in a consistent and non-redundant form. A combination of software, data quality, and strong data leadership can help enterprises and organizations achieve SVOT."},{"id":5,"category":"BI","title":"Operational Reporting","content":"Tactical, real-time reporting that reflects and supports day-to-day activity at an organizational level. Examples of operational reporting include bank teller window balancing reports, daily production records, and transaction logs."},{"id":5,"category":"BI","title":"Power BI","content":"Microsoft’s flagship business analytics data visualization tool. Power BI includes graphically robust dashboards and advanced analytics on both mobile and desktop devices."},{"id":5,"category":"BI","title":"Project Manager","content":"An individual who is responsible for the planning, organization, resource management, and discipline pertaining to the successful completion of a specific project or objective. Our experience is that project managers are most effective when they come from the IT organization – technical skills being critical to understanding the level of effort and time demands of data warehousing tasks. Communication and PM skills are critical as well as a comfort level around senior executives."},{"id":5,"category":"BI","title":"Relational Database","content":"A database structured to recognize relations among stored items of information. Microsoft Dynamics NAV, AX, GP, and SQL are all examples of relational databases. Relational databases include tables and fields which are joined together by keys. They are optimized to get information into a system in a cohesive manner; however, they aren’t optimized for getting the information out."},{"id":5,"category":"BI","title":"Report Distribution","content":"Refers to the methodology used to circulate relevant information to appropriate stakeholders via manual or automated means. To learn more about how to automate your time-consuming report distribution process, see our whitepaper ‘Intuitive Reporting’."},{"id":5,"category":"BI","title":"Sales Dashboard","content":"One of the most widely utilized examples of business intelligence, sales dashboards collate and present relevant sales data including opportunities, pipelines, lead funnels, revenue, product performance, forecasting, customer profitability, and more. By persistently displaying organized sales data, businesses can leverage their notoriously competitive sales departments to drive customer acquisition. To learn more about sales dashboards and the KPIs that can improve your bottom line, download the Jet white paper ‘How to Build KPIs That Actually Drive Revenue.’"},{"id":5,"category":"BI","title":"Schema","content":"Refers to the organization of data as a blueprint of how fact and dimension tables are arranged and constructed to form a relational database. A database schema specifies, based on the database administrator’s knowledge of possible applications, the facts that can enter the database, or those of interest to the possible business users."},{"id":5,"category":"BI","title":"Scorecard","content":"A graphical representation of the progress over time of an enterprise, employee, or business unit, toward some specified goal or goals highlighting relevant KPIs. Performance scorecards are widely used in many industries throughout both the public and private sectors."},{"id":5,"category":"BI","title":"Services Delivery Manager (BI delivery team)","content":"Has accountability for overall success of BI project, within a BI delivery team. The Services Delivery Manager is responsible for staffing and managing the vendor delivery team. The SDM also manages communications with the organization – usually working with product sponsor and business drivers to do so. For more on the roles involved in a BI project and how they impact overall data quality, download our white paper, ”A New Twist on Data Governance from Jet .”"},{"id":5,"category":"BI","title":"Slowly Changing Dimensions (SCD)","content":"Refers to data dimensions that change slowly and unpredictably, rather than on a static or fixed schedule."},{"id":5,"category":"BI","title":"Snowflake Schema","content":"An arrangement of tables in a multidimensional database such that the physical model resembles a snowflake shape. The snowflake schema consists of centralized fact tables which are connected to multiple dimensions."},{"id":5,"category":"BI","title":"SQL Server Analysis Services (SSAS)","content":"Microsoft SQL Server Analysis Services (or SSAS) is an OLAP data mining and reporting tool in Microsoft SQL server. SSAS is used to analyze, access and present information spread across multiple databases or in disparate tables. See also Analysis Services."},{"id":5,"category":"BI","title":"SQL Server Integration Services (SSIS)","content":"An enterprise data integration, transformation, and migration tool that is built into Microsoft’s SQL Server. It is used for a variety of integration-related tasks, such as analyzing and cleansing data or running ETL processes to update data warehouses. SSIS can consolidate data from multiple relational databases as well as sources such as XML data files and flat files."},{"id":5,"category":"BI","title":"Star Schema","content":"The simplest style of data mart schema and most common approach to developing data warehouses and dimensional data marts. The star schema gets its name from the physical model’s resemblance to a star shape with a fact table at its center and the dimension tables surrounding it representing the star’s points."},{"id":5,"category":"BI","title":"Stored Procedure","content":"A batch of SQL statements that can be used to perform a specific task and shared across a network by several clients using different input data. Stored procedures reduce network traffic, increase performance, and protect against SQL injections."},{"id":5,"category":"BI","title":"Subject Matter Expert (SME)","content":"A person who is an authority in a particular area or topic. In some cases, this person can become the go-to resource for ad hoc analysis. The number of subject matter experts your implementation team needs will be determined by the number of user groups from within the organization that will be using the BI tool (finance, operations, sales, HR, etc.)."},{"id":5,"category":"BI","title":"Surrogate key","content":"Within a database, the surrogate key is a unique identifier system wide. The value of a surrogate key generally has many attributes including never being manipulated by a system or a user, contains no semantic meaning, and not being composed of multiple values. The surrogate key is not derived from application data, unlike a natural (or business) key which is derived from application data. Having the key independent of all other columns insulates the database relationships from changes in data values or database design (making the database more agile) and guarantees uniqueness."},{"id":5,"category":"BI","title":"Table Relations","content":"Are a key component in data set building by matching common fields in tables that are related. To ensure data accuracy and limit redundancy, data is split into subject-based tables so that each fact is represented only once; table relationships are then defined and common fields mapped to paint a complete picture."},{"id":5,"category":"BI","title":"View","content":"The result set of a stored query on the data, which the database users can probe just as they would in a persistent database connection object. This pre-established query command is kept in the database dictionary."},{"id":5,"category":"BI","title":"Visual Studio","content":"Microsoft Visual Studio is an integrated development environment (IDE). It is used to develop Windows programs, as well as web sites, web applications, and web services. It is also used to create local database files for SQL."},{"id":4,"category":"SQL","title":"ACID","content":"ACID stands for Atomicity, Consistency, Isolation, and Durability. They are the four attributes that ensure a database transaction is valid."},{"id":4,"category":"SQL","title":"ADF","content":"ADF, or Oracle ADF, stands for Application Development Framework. It’s a web development framework that is based on JSF (Java Server Faces)."},{"id":4,"category":"SQL","title":"ADR","content":"ADR stands for Automatic Diagnostic Repository. It is a hierarchical file-based repository for handling diagnostic information."},{"id":4,"category":"SQL","title":"Aggregation","content":"Aggregation is the process of collapsing or grouping many records into a smaller number of records, based on unique values of a certain field."},{"id":4,"category":"SQL","title":"Alias","content":"An alias in SQL allows you to define a temporary name for a column or a table."},{"id":4,"category":"SQL","title":"ALL Operator","content":"The ALL operator is used with comparison operators (such as > or <=) to compare a value against every value in a list. The condition is TRUE if the value to compare passes the comparison to every value in the list."},{"id":4,"category":"SQL","title":"Ambiguous","content":"The word ambiguous means “open to more than one interpretation; not having one obvious meaning”."},{"id":4,"category":"SQL","title":"Anonymous Block","content":"An anonymous block is a piece of PL\/SQL code that has not been created as a function, package, or procedure."},{"id":4,"category":"SQL","title":"ANSI","content":"ANSI stands for American National Standards Institute. It describes many standards, including the standard for the SQL language."},{"id":4,"category":"SQL","title":"ANY Keyword","content":"The ANY keyword is used with comparison operators (such as > or <=) to compare a value against every value in a list. The condition is TRUE if the value to compare passes the comparison to at least one value in the list."},{"id":4,"category":"SQL","title":"ASCII","content":"ASCII stands for American Standard Code for Information Interchange. It is the numerical representation of character codes."},{"id":4,"category":"SQL","title":"ASH","content":"ASH stands for Active Session History. It’s an Oracle feature that allows you to see current and historical information about active database sessions, based on the V$ dynamic performance views."},{"id":4,"category":"SQL","title":"ASM","content":"ASM, or Oracle ASM, stands for Automatic Storage Management. It’s a feature that was introduced in Oracle 10g to simplify the storage of data files, control files, and log files."},{"id":4,"category":"SQL","title":"Audit","content":"Audit is a command that can be used on the Oracle database to track SQL statements in user sessions."},{"id":4,"category":"SQL","title":"Autonomous transaction","content":"An autonomous transaction is a transaction generated by another transaction. The generated transaction executes without interfering with the transaction that created it."},{"id":4,"category":"SQL","title":"B-Tree (or B-Tree Index)","content":"A b-tree is a type of index in SQL."},{"id":4,"category":"SQL","title":"BFILE","content":"A BFILE is a data type in Oracle that allows you to store a link to a file on the server."},{"id":4,"category":"SQL","title":"BI","content":"BI stands for Business Intelligence. It refers to the area of study and work that uses technology and tools to view a company’s data in more meaningful ways, which allows people at a company to make better decisions."},{"id":4,"category":"SQL","title":"Binary Integer","content":"A binary integer (or BINARY_INTEGER) is a PL\/SQL data type used for storing signed integers."},{"id":4,"category":"SQL","title":"Bind Variable","content":"A bind variable is a variable in an SQL statement that acts as a placeholder. When the statement is run (either in an IDE or in an application that calls the statement), the value needs to be specified for this bind variable."},{"id":4,"category":"SQL","title":"Bitmap Index","content":"A bitmap index is a type of index."},{"id":4,"category":"SQL","title":"BLOB","content":"BLOB stands for Binary Large Object and is a data type. It’s used for storing digital information from other formats (e.g. images and audio) and can store data up to 4GB."},{"id":4,"category":"SQL","title":"Block","content":"A block, in a database, is the smallest unit of storage. A database has a default block size, and blocks in different tablespaces can have different sizes."},{"id":4,"category":"SQL","title":"Boolean","content":"The concept of true or false. Can also be represented as 1 or 0."},{"id":4,"category":"SQL","title":"Bounce","content":"To shut down and restart a database or server."},{"id":4,"category":"SQL","title":"Candidate Key","content":"A candidate key is a key or column that can uniquely identify rows in a table."},{"id":4,"category":"SQL","title":"Cardinality","content":"Cardinality has two different meanings, depending on the context: data modelling or database query development."},{"id":4,"category":"SQL","title":"Cartesian Join","content":"A cartesian join, or cartesian product, is a result of data from two tables that have not been joined to each other."},{"id":4,"category":"SQL","title":"Cascade Constraints","content":"The CASCADE CONSTRAINTS keyword is added to the DROP TABLE keyword. It allows you to drop all referential integrity constraints (foreign keys) that refer to the primary keys and unique keys of the table you’re dropping."},{"id":4,"category":"SQL","title":"CASE","content":"A type of statement that allows for conditional logic (IF THEN ELSE) in SQL."},{"id":4,"category":"SQL","title":"CBO","content":"CBO stands for Cost-Based Optimizer. It’s a method of query optimisation that uses statistics to generate several execution plans, and uses the one with the lowest number of resources required."},{"id":4,"category":"SQL","title":"CHAR","content":"A CHAR is a data type in SQL for holding character or string data. It is a fixed length, which means the number you provide is the number of characters that are stored. Shorter values are padded with spaces to meet the length."},{"id":4,"category":"SQL","title":"Check Constraint","content":"A check constraint is a type of constraint that can be placed on a table or column."},{"id":4,"category":"SQL","title":"Clause","content":"A clause refers to a component of an SQL query that includes a keyword and all data that relates to it."},{"id":4,"category":"SQL","title":"CLI","content":"CLI stands for Command Line Interface. It’s a type of tool that uses text and a command line to allow users to run commands on a database."},{"id":4,"category":"SQL","title":"CLOB","content":"CLOB stands for Character Large Object and is a data type in SQL databases."},{"id":4,"category":"SQL","title":"Cluster","content":"A cluster means two or more computers that share resources and work together to form a larger unit."},{"id":4,"category":"SQL","title":"COALESCE","content":"COALESCE is a function that takes many parameters and returns the first parameter that is not NULL."},{"id":4,"category":"SQL","title":"Column","content":"A column exists in a table and contains related information and has a value specified for each row. It can also be called a field."},{"id":4,"category":"SQL","title":"Column Alias","content":"A column alias is a temporary name given to a column in the SELECT clause of a query."},{"id":4,"category":"SQL","title":"Column-Level Constraint","content":"A column-level constraint is a constraint that is specified at the column level. This means it can only access information about that column."},{"id":4,"category":"SQL","title":"Commit","content":"The act of saving a transaction to the database permanently. Any changes (Insert, Update, or Delete) are not saved permanently to the database until a commit is done."},{"id":4,"category":"SQL","title":"Complex View","content":"A complex view is a type of view that cannot have DML (INSERT, UPDATE, or DELETE) performed on them. This is because complex views can contain join conditions, a GROUP BY clause, and an ORDER BY clause."},{"id":4,"category":"SQL","title":"Composite Key","content":"A composite key is a primary key that contains more than one column."},{"id":4,"category":"SQL","title":"CONCAT","content":"CONCAT is short for “concatenate” and is an Oracle SQL function for joining two strings together."},{"id":4,"category":"SQL","title":"Connection String","content":"A connection string, or connect string, is a string used to identify and connect to a database."},{"id":4,"category":"SQL","title":"Constant","content":"A constant is a variable that does not change value."},{"id":4,"category":"SQL","title":"Constraint","content":"A constraint is a limitation or rule places on a table or columns within a table."},{"id":4,"category":"SQL","title":"Conversion","content":"The process of converting a value from one data type to another."},{"id":4,"category":"SQL","title":"Cross Join","content":"A type of join in SQL that creates a cartesian product on purpose."},{"id":4,"category":"SQL","title":"CRUD","content":"An acronym that refers to a type of application or set of operations that perform data storage:"},{"id":4,"category":"SQL","title":"CTAS","content":"CTAS stands for Create Table As Select. It’s a type of query where you create a new table based on the columns from a SELECT statement and populated with the rows from the same SELECT statement."},{"id":4,"category":"SQL","title":"CTE","content":"CTE stands for Common Table Expression. It’s a feature in many databases that allow you to define a subquery and give it a name, which is then treated like a view inside your query. It helps to simplify your query and can sometimes improve performance. It’s done using the WITH clause in SQL."},{"id":4,"category":"SQL","title":"CURRVAL","content":"CURRVAL is short for Current Value, and is a property of a sequence object. It returns the current value of a sequence, without incrementing it."},{"id":4,"category":"SQL","title":"Cursor","content":"A cursor is a pointer to a result set in procedural languages such as PL\/SQL."},{"id":4,"category":"SQL","title":"Data Dictionary","content":"A data dictionary is a collection of metadata (which is data about other data) in the database. It contains information about the relationships to other data, formats, and what it means."},{"id":4,"category":"SQL","title":"Data integrity","content":"Data integrity refers to the accuracy and consistency of data in a database."},{"id":4,"category":"SQL","title":"Data mart","content":"A data mart is an access layer of a data warehouse. It’s a subset of a data warehouse that is built for a specific purpose, usually a particular business unit."},{"id":4,"category":"SQL","title":"Data model","content":"A data model defines how data is related to other data. It can be represented as entities and attributes in an Entity Relationship Diagram."},{"id":4,"category":"SQL","title":"Data type","content":"A data type denotes the type of data that is stored in a particular column. Different data types are used for different reasons, and using the correct data type makes the database perform better and your queries easier to write."},{"id":4,"category":"SQL","title":"Data warehouse","content":"A data warehouse is a database that has been designed in a way that maximises reading and reporting."},{"id":4,"category":"SQL","title":"Database link","content":"A database link is an object in one database that allows you to access objects (such as tables or views) in another database."},{"id":4,"category":"SQL","title":"DBA","content":"DBA stands for Database Administrator. A DBA is a person responsible for maintaining the database."},{"id":4,"category":"SQL","title":"DBMS","content":"Stands for Database Management System. It’s the software used to store and manipulate data in a database."},{"id":4,"category":"SQL","title":"DCL","content":"DCL stands for Data Control Language, and it is the category of SQL statements that control access to the database and its data."},{"id":4,"category":"SQL","title":"DDL","content":"DDL stands for Data Definition Language, and it is the category of SQL statements that allow users to define and alter database objects."},{"id":4,"category":"SQL","title":"Delete","content":"A statement used to remove data from a table."},{"id":4,"category":"SQL","title":"Denormalize","content":"The process to transform a database design from a normalized format ideal for transactions to a format more suited to data warehouses."},{"id":4,"category":"SQL","title":"Dimension Table","content":"A table in a data warehouse that contains more information about an attribute in a fact table."},{"id":4,"category":"SQL","title":"Directory","content":"A database object on the Oracle database that refers to a folder or directory on the server. SQL statements need to refer to a directory object if they wish to access a file."},{"id":4,"category":"SQL","title":"Distinct","content":"A keyword that means a SELECT statement will eliminate duplicate records from the result set."},{"id":4,"category":"SQL","title":"DML","content":"DML stands for Data Manipulation Language, and is the category of SQL statements used to add, modify, and delete data from tables."},{"id":4,"category":"SQL","title":"Drop","content":"A command used to remove an object from the database, such as a table or a view."},{"id":4,"category":"SQL","title":"Dual","content":"A table in the Oracle database that can be used in SELECT queries when no table is needed."},{"id":4,"category":"SQL","title":"Dynamic SQL","content":"Dynamic SQL is an SQL statement that is constructed and executed during run time."},{"id":4,"category":"SQL","title":"EBS","content":"EBS stands for Oracle E-Business Suite, and it is a suite of applications with different modules, such as:"},{"id":4,"category":"SQL","title":"Embedded SQL","content":"Embedded SQL, or static SQL, is SQL statements that are coded into the program and cannot be changed by the application."},{"id":4,"category":"SQL","title":"Equi-join","content":"A type of join comparison which is done using an equals sign. It allows for one field to be equal to another field. It’s probably the most common type of join comparison."},{"id":4,"category":"SQL","title":"ERD","content":"ERD stands for Entity Relationship Diagram. It’s a diagram that shows the different entities, their attributes, and how they relate to each other in a system."},{"id":4,"category":"SQL","title":"Escape","content":"The process of marking some special characters as being part of the string you want to capture. Often done with single quote characters."},{"id":4,"category":"SQL","title":"ETL","content":"ETL stands for Extract, Transform and Load. It is the process to populate a data warehouse."},{"id":4,"category":"SQL","title":"Exception","content":"An object that is created, either by the database or by a developer, when something goes wrong in procedural code."},{"id":4,"category":"SQL","title":"Explain Plan","content":"A command in SQL for showing the estimated execution cost and method of a query. It’s helpful to see how the query runs and identify any opportunities for improvement."},{"id":4,"category":"SQL","title":"Expression","content":"A combination of one or more values, operators, and functions that result in a value."},{"id":4,"category":"SQL","title":"Extent","content":"A set of side-by-side blocks allocated to a segment within a tablespace."},{"id":4,"category":"SQL","title":"External Table","content":"AN external table is an object in Oracle that allows you to query data that is stored in flat files outside the database."},{"id":4,"category":"SQL","title":"Fact Table","content":"A type of data warehouse table that stores the measurements or values that you want to track in your data warehouse. It’s the centre of the design and relates to dimension tables."},{"id":4,"category":"SQL","title":"Fetch","content":"A PL\/SQL statement that is used to load data from a cursor."},{"id":4,"category":"SQL","title":"Field","content":"Another name for a column in a database. It stores a specific piece of data for a record or row in a table."},{"id":4,"category":"SQL","title":"First Normal Form (1NF)","content":"The first stage of normalizing a database. First normal form means that “each set of columns must uniquely identify a row”."},{"id":4,"category":"SQL","title":"Flashback","content":"Flashback is an Oracle database feature to move the database to a previous state so it can be recovered."},{"id":4,"category":"SQL","title":"Flat file","content":"A file that stores data in a series of single rows. A CSV file can also be called a flat file, as there are no concepts of tables and relationships."},{"id":4,"category":"SQL","title":"Foreign Key","content":"A field in one table that relates to the primary key in another table. Used for referential integrity and relating tables to each other."},{"id":4,"category":"SQL","title":"Fourth Normal Form (4NF)","content":"Fourth normal form is the next step of normalization after third normal form. It means the database must satisfy the rules of third normal form, and also ensure there are “no non-trivial multivalued dependencies other than a candidate key”."},{"id":4,"category":"SQL","title":"FROM Clause","content":"The FROM clause includes the keyword FROM, any tables that are required for the columns being selected, and the JOIN keywords."},{"id":4,"category":"SQL","title":"Full outer join","content":"A type of outer join where values in the left table are shown along with NULL values where there are no matching values in the right table, and values in the right table are shown along with NULL values where there is no matching value in the left table."},{"id":4,"category":"SQL","title":"Function","content":"A piece of code that is stored in the database and can be used by your SQL queries."},{"id":4,"category":"SQL","title":"Functional dependency","content":"A functional dependency exists when the value of one field is completely determined by the value of another."},{"id":4,"category":"SQL","title":"GRANT","content":"A keyword (part of the DCL category) that is used to give privileges for certain tasks to a specified user or role."},{"id":4,"category":"SQL","title":"GROUP BY clause","content":"A clause in an SQL statement that allows you to specify how the data should be grouped in the SELECT query’s output."},{"id":4,"category":"SQL","title":"Hash join","content":"A hash join is where two tables are joined based on a hashing algorithm. You may see this in your Explain Plan output."},{"id":4,"category":"SQL","title":"HAVING Clause","content":"This clause allows you to limit the rows returned by a SELECT query after the GROUP BY clause is applied. It is often used with aggregate functions."},{"id":4,"category":"SQL","title":"Heap-organized table","content":"A heap-organized table is a table in Oracle where the rows are not stored in any particular order. When a specific order is required, it is retrieved using a SELECT query with an ORDER BY clause."},{"id":4,"category":"SQL","title":"Hint","content":"A hint is a special keyword that can be used in a query to alter the execution plan."},{"id":4,"category":"SQL","title":"Histogram","content":"A graph that shows different sizes depending on the frequency of a value in a table."},{"id":4,"category":"SQL","title":"IDE","content":"IDE stands for Integrated Development Environment, and it is software that allows developers to write code and perform many other tasks for application development."},{"id":4,"category":"SQL","title":"IF THEN ELSE","content":"A concept of performing different logic depending on a condition."},{"id":4,"category":"SQL","title":"Index","content":"An object on the database that contains references to each value in a field that lets you quickly locate records in a table."},{"id":4,"category":"SQL","title":"Index-organized table","content":"An index-organized table (or IOT) is a type of table that stores the primary key and non-key data stored in a B-tree structure."},{"id":4,"category":"SQL","title":"Inline view","content":"A SELECT statement which is in the FROM clause of another SELECT statement. It is treated like a view but is not stored as a database object."},{"id":4,"category":"SQL","title":"Inner Join","content":"A type of join where the results of the joined tables are shown where the fields match in both columns. If there is a record in one table but not the other, then data for both records is not shown."},{"id":4,"category":"SQL","title":"INSERT","content":"An SQL command for adding data to a table."},{"id":4,"category":"SQL","title":"INTERSECT","content":"A set operator in SQL that allows you to view the results of one query that exist in the results of another query."},{"id":4,"category":"SQL","title":"Interval","content":"A data type in Oracle that stores a duration of time. It is different to a date or timestamp, which store a period in time."},{"id":4,"category":"SQL","title":"Isolation level","content":"An isolation level is a property that can be set on a session that determines what kind of data can be seen."},{"id":4,"category":"SQL","title":"JDBC","content":"JDBC stands for Java Database Connectivity, and is a standard API that allows Java programs to access databases."},{"id":4,"category":"SQL","title":"JDK","content":"JDK stands for Java Development Kit, and it is a software development environment that’s used for developing Java applications."},{"id":4,"category":"SQL","title":"Join","content":"The concept of linking two tables together on related field, so a query can retrieve data from two tables. It’s one of the main features of relational databases."},{"id":4,"category":"SQL","title":"Keyword","content":"The range of reserved words that are used by the database to process SQL queries. They include commands (such as SELECT and INSERT), set operators (such as UNION) and other words such as JOIN and FROM."},{"id":4,"category":"SQL","title":"LIKE","content":"A keyword that allows you to compare on partial strings. It is often used in the WHERE clause and uses either % wildcards or _ wildcards for string comparison."},{"id":4,"category":"SQL","title":"Listener","content":"An Oracle process for listening for incoming database connections on the server."},{"id":4,"category":"SQL","title":"Literal","content":"A number, character, or string that is enclosed in single quotes in a query."},{"id":4,"category":"SQL","title":"LOB","content":"LOB stands for Large Object and is implemented in Oracle as CLOB, NCLOB, or BLOB data types."},{"id":4,"category":"SQL","title":"Lock","content":"A feature of a database that allows concurrency control and data consistency."},{"id":4,"category":"SQL","title":"Logical operator","content":"A logical operator is a keyword that allows two expressions to be compared and an overall value of TRUE or FALSE to be returned."},{"id":4,"category":"SQL","title":"Many to Many Relationship","content":"A type of relationship between two tables that means many records in one table can relate to many records in another table."},{"id":4,"category":"SQL","title":"Materialized View","content":"A materialized view is a type of view in a database where the data is stored along with the query that created it."},{"id":4,"category":"SQL","title":"Merge","content":"An SQL command that allows you to check if data exists, insert data into a table if the data does not exist, and update the data if it does exist. This is all done in a single command and is an efficient command used in ETL processes."},{"id":4,"category":"SQL","title":"Metadata","content":"Data about data. Metadata is what’s stored in the data dictionary, as it is data about the tables and objects in the database."},{"id":4,"category":"SQL","title":"MINUS","content":"A set operator that allows you to see the results of one query that don’t exist in another query."},{"id":4,"category":"SQL","title":"Multi-row subquery","content":"A subquery that returns more than one row. This is often handled with keywords such as IN, NOT IN, > ALL, < ANY."},{"id":4,"category":"SQL","title":"Multivalued attribute","content":"An attribute that has a value of a set of values. Oracle includes the Nested Table and VARRAY data types for this."},{"id":4,"category":"SQL","title":"Mutating Table","content":"A mutating table is a table that is being changed."},{"id":4,"category":"SQL","title":"Natural Join","content":"A join type where two tables are joined without specifying the columns. The columns that have the same names in both tables are used as the join fields."},{"id":4,"category":"SQL","title":"Natural key","content":"A natural key is a primary key made up of columns already in the table."},{"id":4,"category":"SQL","title":"NCHAR","content":"An Oracle datatype, similar to CHAR, but can hold Unicode characters. It has a fixed length, just like the CHAR data type."},{"id":4,"category":"SQL","title":"Nested Table","content":"An Oracle data type that can support entire tables of values in a single column."},{"id":4,"category":"SQL","title":"NEXTVAL","content":"A property of a sequence that increments the current sequence value and returns it. Often used for inserting primary key values into a table."},{"id":4,"category":"SQL","title":"NLS","content":"NLS stands for National Language Support), and it is used to define the date, number, currency, and language settings for different nations."},{"id":4,"category":"SQL","title":"Non-equi-join","content":"A type of join condition where the columns being compared are not equal."},{"id":4,"category":"SQL","title":"Normalization","content":"The process of modifying a database design to align with a standard set of rules and make it ideal for transactions."},{"id":4,"category":"SQL","title":"NULLIF","content":"A function that returns NULL if the two expressions are equal, but returns the first expression if they are not."},{"id":4,"category":"SQL","title":"Number","content":"An SQL datatype used for storing whole numbers and decimal numbers."},{"id":4,"category":"SQL","title":"NVARCHAR2","content":"An Oracle data type that stores a variable-length string, like VARCHAR2, but can store Unicode characters."},{"id":4,"category":"SQL","title":"OBIEE","content":"OBIEE stands for Oracle Business Intelligence Enterprise Edition. It’s a set of business intelligence and analytics platforms that perform business intelligence functions on a data warehouse."},{"id":4,"category":"SQL","title":"OCA","content":"OCA stands for Oracle Certified Associate. It is the entry-level Oracle DBA certification. Once you have this certification, you have the skills for a junior level DBA."},{"id":4,"category":"SQL","title":"OCM","content":"OCM stands for Oracle Certified Master, and it is the third level of the DBA certification track and is targeted to senior DBAs and consultants."},{"id":4,"category":"SQL","title":"OCP","content":"OCP stands for Oracle Certified Professional, and is the second certification on the Oracle DBA track. It is targeted to mid to senior level DBAs."},{"id":4,"category":"SQL","title":"ODI","content":"ODI stands for Oracle Data Integrator, and is an ETL tool used to move data between different systems."},{"id":4,"category":"SQL","title":"OLAP","content":"OLAP stands for Online Analytical Processing, and is a type of system that allows users to analyse and manipulate the display of data to make decisions."},{"id":4,"category":"SQL","title":"OLTP","content":"OLTP stands for Online Transactional Processing, and is a type of system that allows for large numbers of transactions (insert, update, delete, and select) to be performed on a system."},{"id":4,"category":"SQL","title":"On Delete Cascade","content":"A setting when creating a foreign key that says if a record in the parent table is deleted, then the corresponding records in the child table are also deleted."},{"id":4,"category":"SQL","title":"One to Many Relationship","content":"A type of relationship where a record in one table can relate to many records in another table."},{"id":4,"category":"SQL","title":"One to One Relationship","content":"A type of relationship where a record in one table can have only one record in another table, in both directions."},{"id":4,"category":"SQL","title":"Operator","content":"A symbol (>, =, <=, etc) or keyword (NOT, IN, ALL, UNION) that is placed between expressions to compare them."},{"id":4,"category":"SQL","title":"Oracle Fusion","content":"A set of applications that help with enterprise resource planning. It is the replacement for EBS (Oracle E-Business Suite), and includes financials, supply chain management, HR, and many other areas."},{"id":4,"category":"SQL","title":"ORACLE_HOME","content":"The directory or environment variable that points to where Oracle is installed."},{"id":4,"category":"SQL","title":"OTN","content":"OTN stands for Oracle Technology Network and is Oracle’s community website. It includes forums and product documentation."},{"id":4,"category":"SQL","title":"Outer Join","content":"A type of join where records from one table are shown, and if there are records in the second table, they are shown, but if no records match, then show a NULL value."},{"id":4,"category":"SQL","title":"Package","content":"A collection of related PL\/SQL code (functions and procedures) into a single unit. Packages are used to improve the security and design of your code."},{"id":4,"category":"SQL","title":"PGA","content":"PGA stands for Process Global Area, and is an area in RAM that stores data for a single process."},{"id":4,"category":"SQL","title":"PLS_INTEGER","content":"A data type, only available in PL\/SQL, that is used for storing signed integers."},{"id":4,"category":"SQL","title":"Pragma","content":"A pragma is a compiler directive, or hint, that is used to provide an instruction to the compiler."},{"id":4,"category":"SQL","title":"Predicate","content":"The expression used in a WHERE clause to specify which rows should be returned."},{"id":4,"category":"SQL","title":"Primary Key","content":"A field in a table that is used to uniquely identify a row."},{"id":4,"category":"SQL","title":"Privilege","content":"A permission that can be granted to or revoked from a specific user or role, which allows the user or role to perform certain actions."},{"id":4,"category":"SQL","title":"Procedure","content":"A stored piece of procedural code that allows parameters to be provided and returned, and perform complex functionality."},{"id":4,"category":"SQL","title":"Pseudocolumn","content":"A column that is automatically added to every database table to display data about the record."},{"id":4,"category":"SQL","title":"Query","content":"A collection of SQL keywords which allows for a specific action to be taken. A query is run on its own as part of a transaction."},{"id":4,"category":"SQL","title":"RAC","content":"RAC stands for Oracle Real Application Clusters. It is a database solution that allows more than one system to share a single Oracle database."},{"id":4,"category":"SQL","title":"RAW","content":"An old Oracle data type used to store binary data, such as images or audio. It has been replaced by the BLOB data type."},{"id":4,"category":"SQL","title":"RBO","content":"Stands for Rules-Based Optimizer, and is a query optimizer that uses different rules to define the best query execution plan."},{"id":4,"category":"SQL","title":"RDBMS","content":"RDBMS stands for Relational Database Management System and is a type of DBMS where the tables are organised according to relationships between the data."},{"id":4,"category":"SQL","title":"REF CURSOR","content":"A data type that holds a cursor value. It is used to pass the single cursor object to a different part of the code, instead of the individual values within it."},{"id":4,"category":"SQL","title":"Relation","content":"A mathematical term for a table."},{"id":4,"category":"SQL","title":"Relationship","content":"The link or association between two entities in an ERD or tables in a database."},{"id":4,"category":"SQL","title":"REVOKE","content":"A command used to remove a privilege from a user or role. The opposite of a GRANT command."},{"id":4,"category":"SQL","title":"RMAN","content":"RMAN stands for Recovery Manager and is a utility used to backup, restore, clone, and recover Oracle databases."},{"id":4,"category":"SQL","title":"Role","content":"A group of privileges that can be granted or revoked from users."},{"id":4,"category":"SQL","title":"ROLLBACK","content":"A command used to undo any changes made to the data in the tables during your current transaction. The opposite of the COMMIT keyword."},{"id":4,"category":"SQL","title":"Rollback segment","content":"An object that contains images of before data was written to the database. They are used to undo changes when a transaction is rolled back."},{"id":4,"category":"SQL","title":"ROWID","content":"A value for a row that is unique within the database. It contains a 10-byte character value that represents the location on the physical disk that the row lives."},{"id":4,"category":"SQL","title":"ROWNUM","content":"A pseudocolumn that shows the row’s position in a result set."},{"id":4,"category":"SQL","title":"Savepoint","content":"A savepoint is a marker in a transaction that can be set as a point to roll back to at a later time."},{"id":4,"category":"SQL","title":"Schema","content":"A schema is the set of objects (tables, views, sequences) that belong to a user account."},{"id":4,"category":"SQL","title":"SCN","content":"SCN stands for System Change Number and represents a unique number for every time a commit is made."},{"id":4,"category":"SQL","title":"Second Normal Form (2NF)","content":"The second stage of normalization. A database is in second normal form if it meets the rules of first normal form, and “all of the non-key attributes are dependent on the primary key”."},{"id":4,"category":"SQL","title":"Segment","content":"A database object that has space allocated to it."},{"id":4,"category":"SQL","title":"SELECT","content":"An SQL keyword for viewing data in the database."},{"id":4,"category":"SQL","title":"Self Join","content":"A type of join where you join a table to itself."},{"id":4,"category":"SQL","title":"Sequence","content":"A database object that is used to generate unique numbers. It’s great for primary key values and IDs, and ensures different transactions get different values. Read more about sequences here."},{"id":4,"category":"SQL","title":"Session","content":"The set of events that happen from when a user connects to a database to when the user disconnects from the database."},{"id":4,"category":"SQL","title":"SGA","content":"SGA stands for System Global Area. It forms part of the RAM and contains all of the information needed to operate the instance."},{"id":4,"category":"SQL","title":"SID","content":"SID stands for System Identifier, and it uniquely identifies an Oracle database instance on a system."},{"id":4,"category":"SQL","title":"Single-row subquery","content":"A subquery that always returns a single row, either using a unique constraint in the WHERE clause or an aggregate function."},{"id":4,"category":"SQL","title":"SQL","content":"SQL stands for Structured Query Language and is the language used to communicate with a database."},{"id":4,"category":"SQL","title":"SQLCODE","content":"An Oracle function that returns the number code for the most recent exception. The SQLCODE function is often used along with the SQLERRM function."},{"id":4,"category":"SQL","title":"Star schema","content":"A database design for data warehouses and data marts that contains a single fact table and multiple dimension tables linked to it."},{"id":4,"category":"SQL","title":"Subquery","content":"A SELECT query that is run inside another query. Often used to get the results of one query and use it as an input into another query."},{"id":4,"category":"SQL","title":"Surrogate key","content":"A new field created for the purpose of a primary key for a table, instead of using an existing field."},{"id":4,"category":"SQL","title":"Synonym","content":"A database object that is a pointer to another object, such as a table or view."},{"id":4,"category":"SQL","title":"SYS","content":"The username and schema that contains the data dictionary in Oracle."},{"id":4,"category":"SQL","title":"Table-level constraint","content":"A constraint that is defined at the table level, after all of the columns have been defined."},{"id":4,"category":"SQL","title":"Tablespace","content":"A logical storage unit that stores all of the data for the tables."},{"id":4,"category":"SQL","title":"Third normal form (3NF)","content":"The third and ideal stage of normalization."},{"id":4,"category":"SQL","title":"TIMESTAMP","content":"A data type in Oracle that stores the date, time, and fractional time in seconds."},{"id":4,"category":"SQL","title":"TIMESTAMP WITH TIME ZONE","content":"A data type in Oracle that stores the date, time, fractional time in seconds, and a timezone value."},{"id":4,"category":"SQL","title":"TKProf","content":"TKProf is an Oracle utility used to format the output of SQL Trace into something that’s more readable."},{"id":4,"category":"SQL","title":"TNS","content":"TNS stands for Transparent Network Substrate, and is a technology for connecting to Oracle databases."},{"id":4,"category":"SQL","title":"TNSNAMES.ora","content":"A file that contains network service names and how they map to connection descriptors or connection strings."},{"id":4,"category":"SQL","title":"Toad","content":"An IDE for SQL developers, allowing developers to connect to an Oracle database, write and run queries, and much more."},{"id":4,"category":"SQL","title":"Transaction","content":"A single unit of work that must be saved or rolled back in its entirety. Transactions start when a user connects to a database and end when a user commits or rolls back."},{"id":4,"category":"SQL","title":"Transitive dependency","content":"Transitive dependency means that one attribute determines a second attribute indirectly, as it involves a third attribute in the middle."},{"id":4,"category":"SQL","title":"Trigger","content":"A database object that is attached to a table that is called when a row is inserted, updated, or deleted. Triggers contain procedural code and allow you to check that changes are correct or add in any data that needs to be there but is not specified by the SQL statement."},{"id":4,"category":"SQL","title":"TRUNCATE","content":"An SQL statement that deletes all data from a table. Generally faster than a DELETE statement as there is no log and the transaction is committed."},{"id":4,"category":"SQL","title":"Tuple","content":"Another name for a row in a table. A tuple exists in a relation."},{"id":4,"category":"SQL","title":"UDT","content":"UDT stands for User Defined Type and is a type that is created by a user in a PL\/SQL program."},{"id":4,"category":"SQL","title":"UID","content":"UID stands for User Identification and is a pseudocolumn that holds a numeric value for the currently logged-in user."},{"id":4,"category":"SQL","title":"UML","content":"UML stands for Unified Modelling Language, and it is a general-purpose modelling language for visualizing the design of a system."},{"id":4,"category":"SQL","title":"UNION","content":"The UNION keyword is a set operator that allows for the results of one query to be combined with the results of another query, and duplicates removed."},{"id":4,"category":"SQL","title":"UNION ALL","content":"The UNION ALL keyword is a set operator that allows for the results of one query to be combined with the results of another query, and duplicates kept."},{"id":4,"category":"SQL","title":"Unique key\/Unique constraint","content":"A unique key, or unique constraint, is a constraint that ensures only unique values are entered into the column specified."},{"id":4,"category":"SQL","title":"UPDATE","content":"An SQL command used for making changes to data that exists in a table already."},{"id":4,"category":"SQL","title":"User","content":"It can refer to a user account on the database that someone logs in as."},{"id":4,"category":"SQL","title":"VARCHAR","content":"A data type in the SQL standard that allows for variable-length character data to be stored."},{"id":4,"category":"SQL","title":"VARCHAR2","content":"A variable length data type for holding character data."},{"id":4,"category":"SQL","title":"VARRAY","content":"A data type used to support a column that contains multiple values. Kind of like an array."},{"id":4,"category":"SQL","title":"View","content":"A SELECT query stored on the database, but has a name and is treated like a table. Other queries can select from this view, and the underlying query is run each time."},{"id":4,"category":"SQL","title":"Wildcard","content":"A character that can be substituted for one or more characters."},{"id":4,"category":"SQL","title":"XE","content":"XE stands for Express Edition, and it refers to the freely available Oracle database."},{"id":6,"category":"ML","title":"Accuracy","content":"Percentage of correct predictions made by the model."},{"id":6,"category":"ML","title":"Algorithm","content":"A method, function, or series of instructions used to generate a machine learning model. Examples include linear regression, decision trees, support vector machines, and neural networks."},{"id":6,"category":"ML","title":"Attribute","content":"A quality describing an observation (e.g. color, size, weight). In Excel terms, these are column headers."},{"id":6,"category":"ML","title":"Bias metric","content":"What is the average difference between your predictions and the correct value for that observation?\n\nLow bias could mean every prediction is correct. It could also mean half of your predictions are above their actual values and half are below, in equal proportion, resulting in low average difference.\nHigh bias (with low variance) suggests your model may be underfitting and you’re using the wrong architecture for the job."},{"id":6,"category":"ML","title":"Bias term","content":"Allow models to represent patterns that do not pass through the origin. For example, if all my features were 0, would my output also be zero? Is it possible there is some base value upon which my features have an effect? Bias terms typically accompany weights and are attached to neurons or filters."},{"id":6,"category":"ML","title":"Categorical Variables","content":"Variables with a discrete set of possible values. Can be ordinal (order matters) or nominal (order doesn’t matter)."},{"id":6,"category":"ML","title":"Classification","content":"Predicting a categorical output.\n\nBinary classification predicts one of two possible outcomes (e.g. is the email spam or not spam?)\nMulti-class classification predicts one of multiple possible outcomes (e.g. is this a photo of a cat, dog, horse or human?)"},{"id":6,"category":"ML","title":"Classification Threshold","content":"The lowest probability value at which we’re comfortable asserting a positive classification. For example, if the predicted probability of being diabetic is > 50%, return True, otherwise return False."},{"id":6,"category":"ML","title":"Clustering","content":"Unsupervised grouping of data into buckets."},{"id":6,"category":"ML","title":"Confusion Matrix","content":"Table that describes the performance of a classification model by grouping predictions into 4 categories.\n\nTrue Positives: we correctly predicted they do have diabetes\nTrue Negatives: we correctly predicted they don’t have diabetes\nFalse Positives: we incorrectly predicted they do have diabetes (Type I error)\nFalse Negatives: we incorrectly predicted they don’t have diabetes (Type II error)"},{"id":6,"category":"ML","title":"Continuous Variables","content":"Variables with a range of possible values defined by a number scale (e.g. sales, lifespan)."},{"id":6,"category":"ML","title":"Convergence","content":"A state reached during the training of a model when the loss changes very little between each iteration."},{"id":6,"category":"ML","title":"Deduction","content":"A top-down approach to answering questions or solving problems. A logic technique that starts with a theory and tests that theory with observations to derive a conclusion. E.g. We suspect X, but we need to test our hypothesis before coming to any conclusions."},{"id":6,"category":"ML","title":"Deep Learning","content":"Deep Learning is derived from a machine learning algorithm called perceptron or multi layer perceptron that is gaining more and more attention nowadays because of its success in different fields like, computer vision to signal processing and medical diagnosis to self-driving cars. Like other AI algorithms, deep learning is based on decades of research. Nowadays, we have more and more data and cheap computing power that makes this algorithm really powerful in achieving state of the art accuracy. In modern world this algorithm is known as artificial neural network. Deep learning is much more accurate and robust compared to traditional artificial neural networks. But it is highly influenced by machine learning’s neural network and perceptron networks."},{"id":6,"category":"ML","title":"Dimension","content":"Dimension for machine learning and data scientist is different from physics. Here, dimension of data means how many features you have in your data ocean(data-set). e.g in case of object detection application, flatten image size and color channel(e.g 28*28*3) is a feature of the input set. In case of house price prediction (maybe) house size is the data-set so we call it 1 dimentional data."},{"id":6,"category":"ML","title":"Epoch","content":"An epoch describes the number of times the algorithm sees the entire data set."},{"id":6,"category":"ML","title":"Extrapolation","content":"Making predictions outside the range of a dataset. E.g. My dog barks, so all dogs must bark. In machine learning we often run into trouble when we extrapolate outside the range of our training data."},{"id":6,"category":"ML","title":"False Positive Rate","content":"Defined as\n\n\\[FPR = 1 - Specificity = \\frac{False Positives}{False Positives + True Negatives}\\]\nThe False Positive Rate forms the x-axis of the ROC curve."},{"id":6,"category":"ML","title":"Feature","content":"With respect to a dataset, a feature represents an attribute and value combination. Color is an attribute. “Color is blue” is a feature. In Excel terms, features are similar to cells. The term feature has other definitions in different contexts."},{"id":6,"category":"ML","title":"Feature Selection","content":"Feature selection is the process of selecting relevant features from a data-set for creating a Machine Learning model."},{"id":6,"category":"ML","title":"Feature Vector","content":"A list of features describing an observation with multiple attributes. In Excel we call this a row."},{"id":6,"category":"ML","title":"Gradient Accumulation","content":"A mechanism to split the batch of samples—used for training a neural network—into several mini-batches of samples that will be run sequentially. This is used to enable using large batch sizes that require more GPU memory than available."},{"id":6,"category":"ML","title":"Hyperparameters","content":"Hyperparameters are higher-level properties of a model such as how fast it can learn (learning rate) or complexity of a model. The depth of trees in a Decision Tree or number of hidden layers in a Neural Networks are examples of hyper parameters."},{"id":6,"category":"ML","title":"Induction","content":"A bottoms-up approach to answering questions or solving problems. A logic technique that goes from observations to theory. E.g. We keep observing X, so we infer that Y must be True."},{"id":6,"category":"ML","title":"Instance","content":"A data point, row, or sample in a dataset. Another term for observation."},{"id":6,"category":"ML","title":"Label","content":"The “answer” portion of an observation in supervised learning. For example, in a dataset used to classify flowers into different species, the features might include the petal length and petal width, while the label would be the flower’s species."},{"id":6,"category":"ML","title":"Learning Rate","content":"The size of the update steps to take during optimization loops like Gradient Descent. With a high learning rate we can cover more ground each step, but we risk overshooting the lowest point since the slope of the hill is constantly changing. With a very low learning rate, we can confidently move in the direction of the negative gradient since we are recalculating it so frequently. A low learning rate is more precise, but calculating the gradient is time-consuming, so it will take us a very long time to get to the bottom."},{"id":6,"category":"ML","title":"Loss","content":"Loss = true_value(from data-set)- predicted value(from ML-model)  The lower the loss, the better a model (unless the model has over-fitted to the training data). The loss is calculated on training and validation and its interpretation is how well the model is doing for these two sets. Unlike accuracy, loss is not a percentage. It is a summation of the errors made for each example in training or validation sets."},{"id":6,"category":"ML","title":"Machine Learning","content":"Mitchell (1997) provides a succinct definition: “A computer program is said to learn from experience E with respect to some class of tasks T and performance measure P, if its performance at tasks in T, as measured by P, improves with experience E.” In simple language machine learning is a field in which human made algorithms have an ability learn by itself or predict future for unseen data."},{"id":6,"category":"ML","title":"Model","content":"A data structure that stores a representation of a dataset (weights and biases). Models are created\/learned when you train an algorithm on a dataset."},{"id":6,"category":"ML","title":"Neural Networks","content":"Neural Networks are mathematical algorithms modeled after the brain’s architecture, designed to recognize patterns and relationships in data."},{"id":6,"category":"ML","title":"Normalization","content":"Restriction of the values of weights in regression to avoid overfitting and improving computation speed."},{"id":6,"category":"ML","title":"Noise","content":"Any irrelevant information or randomness in a dataset which obscures the underlying pattern."},{"id":6,"category":"ML","title":"Null Accuracy","content":"Baseline accuracy that can be achieved by always predicting the most frequent class (“B has the highest frequency, so lets guess B every time”)."},{"id":6,"category":"ML","title":"Observation","content":"A data point, row, or sample in a dataset. Another term for instance."},{"id":6,"category":"ML","title":"Outlier","content":"An observation that deviates significantly from other observations in the dataset."},{"id":6,"category":"ML","title":"Overfitting","content":"Overfitting occurs when your model learns the training data too well and incorporates details and noise specific to your dataset. You can tell a model is overfitting when it performs great on your training\/validation set, but poorly on your test set (or new real-world data)."},{"id":6,"category":"ML","title":"Parameters","content":"Parameters are properties of training data learned by training a machine learning model or classifier. They are adjusted using optimization algorithms and unique to each experiment.\nExamples of parameters include:\n\nweights in an artificial neural network\nsupport vectors in a support vector machine\ncoefficients in a linear or logistic regression"},{"id":6,"category":"ML","title":"Precision","content":"In the context of binary classification (Yes\/No), precision measures the model’s performance at classifying positive observations (i.e. “Yes”). In other words, when a positive value is predicted, how often is the prediction correct? We could game this metric by only returning positive for the single observation we are most confident in.\n\n\\[P = \\frac{True Positives}{True Positives + False Positives}\\]"},{"id":6,"category":"ML","title":"Recall","content":"Also called sensitivity. In the context of binary classification (Yes\/No), recall measures how “sensitive” the classifier is at detecting positive instances. In other words, for all the true observations in our sample, how many did we “catch.” We could game this metric by always classifying observations as positive.\n\n\\[R = \\frac{True Positives}{True Positives + False Negatives}\\]"},{"id":6,"category":"ML","title":"Recall vs Precision","content":"Say we are analyzing Brain scans and trying to predict whether a person has a tumor (True) or not (False). We feed it into our model and our model starts guessing.\n\nPrecision is the % of True guesses that were actually correct! If we guess 1 image is True out of 100 images and that image is actually True, then our precision is 100%! Our results aren’t helpful however because we missed 10 brain tumors! We were super precise when we tried, but we didn’t try hard enough.\nRecall, or Sensitivity, provides another lens which with to view how good our model is. Again let’s say there are 100 images, 10 with brain tumors, and we correctly guessed 1 had a brain tumor. Precision is 100%, but recall is 10%. Perfect recall requires that we catch all 10 tumors!"},{"id":6,"category":"ML","title":"Regression","content":"Predicting a continuous output (e.g. price, sales)."},{"id":6,"category":"ML","title":"Regularization","content":"Regularization is a technique utilized to combat the overfitting problem. This is achieved by adding a complexity term to the loss function that gives a bigger loss for more complex models"},{"id":6,"category":"ML","title":"Reinforcement Learning","content":"Training a model to maximize a reward via iterative trial and error."},{"id":6,"category":"ML","title":"ROC (Receiver Operating Characteristic) Curve","content":"A plot of the true positive rate against the false positive rate at all classification thresholds. This is used to evaluate the performance of a classification model at different classification thresholds. The area under the ROC curve can be interpreted as the probability that the model correctly distinguishes between a randomly chosen positive observation (e.g. “spam”) and a randomly chosen negative observation (e.g. “not spam”)."},{"id":6,"category":"ML","title":"Segmentation","content":"It is the process of partitioning a data set into multiple distinct sets. This separation is done such that the members of the same set are similar to each otherand different from the members of other sets."},{"id":6,"category":"ML","title":"Specificity","content":"In the context of binary classification (Yes\/No), specificity measures the model’s performance at classifying negative observations (i.e. “No”). In other words, when the correct label is negative, how often is the prediction correct? We could game this metric if we predict everything as negative.\n\n\\[S = \\frac{True Negatives}{True Negatives + False Positives}\\]"},{"id":6,"category":"ML","title":"Supervised Learning","content":"Training a model using a labeled dataset."},{"id":6,"category":"ML","title":"Test Set","content":"A set of observations used at the end of model training and validation to assess the predictive power of your model. How generalizable is your model to unseen data?"},{"id":6,"category":"ML","title":"Training Set","content":"A set of observations used to generate machine learning models."},{"id":6,"category":"ML","title":"Transfer Learning","content":"A machine learning method where a model developed for a task is reused as the starting point for a model on a second task. In transfer learning, we take the pre-trained weights of an already trained model (one that has been trained on millions of images belonging to 1000’s of classes, on several high power GPU’s for several days) and use these already learned features to predict new classes."},{"id":6,"category":"ML","title":"True Positive Rate","content":"Another term for recall, i.e.\n\n\\[TPR = \\frac{True Positives}{True Positives + False Negatives}\\]\nThe True Positive Rate forms the y-axis of the ROC curve."},{"id":6,"category":"ML","title":"Type 1 Error","content":"False Positives. Consider a company optimizing hiring practices to reduce false positives in job offers. A type 1 error occurs when candidate seems good and they hire him, but he is actually bad."},{"id":6,"category":"ML","title":"Type 2 Error","content":"False Negatives. The candidate was great but the company passed on him."},{"id":6,"category":"ML","title":"Underfitting","content":"Underfitting occurs when your model over-generalizes and fails to incorporate relevant variations in your data that would give your model more predictive power. You can tell a model is underfitting when it performs poorly on both training and test sets."},{"id":6,"category":"ML","title":"Universal Approximation Theorem","content":"A neural network with one hidden layer can approximate any continuous function but only for inputs in a specific range. If you train a network on inputs between -2 and 2, then it will work well for inputs in the same range, but you can’t expect it to generalize to other inputs without retraining the model or adding more hidden neurons."},{"id":6,"category":"ML","title":"Unsupervised Learning","content":"Training a model to find patterns in an unlabeled dataset (e.g. clustering)."},{"id":6,"category":"ML","title":"Validation Set","content":"A set of observations used during model training to provide feedback on how well the current parameters generalize beyond the training set. If training error decreases but validation error increases, your model is likely overfitting and you should pause training."},{"id":6,"category":"ML","title":"Variance","content":"How tightly packed are your predictions for a particular observation relative to each other?\n\nLow variance suggests your model is internally consistent, with predictions varying little from each other after every iteration.\nHigh variance (with low bias) suggests your model may be overfitting and reading too deeply into the noise found in every training set."},{"id":6,"category":"ML","title":"Versions","content":"latest"},{"id":6,"category":"ML","title":"Downloads","content":"pdf"},{"id":6,"category":"ML","title":"On Read the Docs","content":"Project Home"}]